package com.example.showroom.controller;

import com.example.showroom.model.Product;
import org.springframework.stereotype.Controller;
import org.springframework.ui.Model;
import org.springframework.web.bind.annotation.*;

import java.util.ArrayList;
import java.util.List;

@Controller
public class ProductController {

    public List<Product> getAllProducts() {
        return products;
    }
    private List<Product> products = new ArrayList<>();

    public ProductController() {
        products.add(new Product(1L, "Intel Core i5-14400F", "CPU", 200, "\n" +
                "Процесор Intel Core 14-го покоління для настільних ПК з розблокованим множником оптимізовано для ентузіастів-геймерів та серйозних творців.\n" +
                "\n" +
                "Сумісність з материнськими платами з урахуванням чіпсетів серії 700/600.", "/images/cpu2.jpg"));

        products.add(new Product(2L, "ASUS PCI-Ex GeForce RTX 3060 Dual OC V2 LHR 12GB GDDR6 ", "GPU", 535, "Ця відеокарта є Limited Hash Rate версією — обладнана апаратним обмежувачем майнінгу Ethereum.\n" +
                "\n" +
                "Мікроархітектура NVIDIA Ampere:\n" +
                "Нова мікроархітектура NVIDIA Ampere виводить гру на новий рівень завдяки поліпшеним функційним блокам, включно з RT-ядрами другого покоління й тензорними ядрами третього покоління.\n" +
                "\n" +
                "Вмикаємо RTX!:\n" +
                "Фантастичний реалізм і висока швидкість, що стали можливими завдяки технологіям трасування променів і штучного інтелекту, — в іграх нового покоління!\n" +
                "\n" +
                "Технологія DLSS:\n" +
                "Технологія згладжування з алгоритмами глибокого навчання NVIDIA DLSS забезпечує безкомпромісну якість зображення завдяки використанню наявних у відеокартах GeForce RTX тензорних ядер. Водночас вона мало впливає на швидкість гри, що дасть змогу викрутити настроювання на максимум. Штучний інтелект — на службі в геймерів!\n" +
                "\n" +
                "Платформа для творчості:\n" +
                "Відеокарти серії GeForce RTX 30 підходять не лише для ігор, але й для продуктивної роботи. Підтримка технологій штучного інтелекту, сумісність із програмною платформою NVIDIA Studio і висока продуктивність роблять їх чудовим вибором для тривимірного моделювання, редагування відеоматеріалів у форматі 8K або стримінга в прямому ефірі.", "/images/video1.jpg"));
        products.add(new Product(3L, "Kingston Fury SODIMM DDR4-3200 16384 MB PC4-25600 Impact Black", "RAM", 137, "Високошвидкісні модулі пам’яті SODIMM, створені спеціально для підвищення продуктивності й зниження системних затримок в ноутбуках та ПК компактних форм-факторів, дозволяють значно прискорити роботу й зменшити енергоспоживання систем в іграх та професійних ресурсомістких програмах — оптимальне рішення для оновлення компактних систем на основі процесорів Intel або AMD.\n" +
                "Переваги:\n" +
                "Висока продуктивність з підтримкою автоматичного розгону Plug N Play\n" +
                "Сумісність з Intel XMP та AMD Ryzen\n" +
                "Компактний форм-фактор\n" +
                "Висока енергоефективність\n" +
                "Широкий діапазон ємностей", "/images/ope1.jpg"));
        products.add(new Product(4L, "Миша Logitech G102 Lightsync USB Black", "Periphery", 27, "Ця ігрова миша поєднує в собі класичний шестикнопковий дизайн із передовими технологіями, пропонуючи датчик ігрового класу з регульованою чутливістю від 200 до 8000 DPI. Головною особливістю є інтелектуальна RGB-підсвітка LIGHTSYNC, яка підтримує 16,8 млн відтінків та здатна динамічно синхронізуватися з подіями на екрані або ритмом музики.\n" +
                "\n" +
                "Завдяки фірмовому ПЗ Logitech G HUB, користувачі можуть повністю персоналізувати пристрій: від створення унікальних профілів підсвітки до програмування клавіш під ігрові команди. Надійність та приємний відгук забезпечує оптимізований механізм кнопок із металевими пружинами, що гарантує стабільне та чітке спрацьовування в кожному раунді.","/images/mouss.jpg"));
        products.add(new Product(5L, "TUF Gaming B850-PLUS","Mother", 250, "\n" +
                "ASUS TUF GAMING B850-PLUS WIFI увібрала в себе всі основні елементи новітніх процесорів AMD Ryzen і поєднала їх з ігровими функціями та перевіреною довговічністю. Завдяки компонентам військового класу, модернізованій системі живлення та комплексній системі охолодження ця материнська плата перевершує всі очікування, забезпечуючи надійну та стабільну продуктивність для марафонських ігор. Материнські плати TUF GAMING також проходять суворі випробування на витривалість, щоб гарантувати, що вони зможуть впоратися з умовами, в яких інші можуть зазнати невдачі. Ця платформа забезпечує потужність і можливості підключення, яких вимагають сучасні програми для ПК зі штучним інтелектом.","/images/mama1.jpg"));
        products.add(new Product(6L,"AMD Ryzen 7 9800X3D", "CPU",500, "\n" +
                "Найшвидший виграє:\n" +
                "Цей найкращий у світі процесор для настільних ПК гарантує чудову продуктивність в іграх.\n" +
                "\n" +
                "Технологія AMD StoreMI:\n" +
                "Простий і швидкий спосіб розширити сховище даних настільного ПК з процесором AMD Ryzen та прискорити його роботу.\n" +
                "\n" +
                "Програма AMD Ryzen Master:\n" +
                "Проста та потужна програма для розгону процесорів AMD Ryzen.\n" +
                "\n" +
                "AMD Ryzen VR-Ready Premium:\n" +
                "Для користувачів, які хочуть отримати максимум задоволення від використання технології віртуальної реальності, компанія AMD пропонує високопродуктивні процесори Ryzen VR-Ready Premium.","/images/proc1.jpg"));
    products.add(new Product(7L, "ASUS PCI-Ex GeForce RTX 5070 Dual OC Edition 12GB GDDR7", "GPU", 755, "\n" +
            "Два вентилятори — ідеальна сумісність\n" +
            "ASUS Dual GeForce RTX 5070 поєднує в собі потужну систему охолодження та широку сумісність. Передові технології охолодження, запозичені у флагманських відеокарт, включаючи два вентилятори Axial-tech, оптимізують повітряний потік до радіатора. Компактний корпус дозволяє отримати максимальну продуктивність при мінімальних габаритах. Ці особливості роблять ASUS Dual відмінним вибором для геймерів, яким потрібна потужна відеокарта в компактній збірці.\n" +
            " \n" +
            "Компактний дизайн з двома вентиляторами:\n" +
            "Ретельно спроєктований кожух, радіатор і теплові трубки дозволяють двом вентиляторам Axial-tech використовувати вентиляцію збоку корпусу, забезпечуючи охолодження, що перевершує можливості типових компактних відеокарт.\n" +
            " \n" +
            "Оновлені вентилятори Axial-tech:\n" +
            "Два перевірених вентилятори Axial-tech зі зменшеною центральною частиною, подовженими лопатями і фіксуючим кільцем забезпечують посилений тиск повітря вниз — для зниження температури, зниження шуму і збільшення продуктивності.\n" +
            " \n" +
            "Технологія 0dB:\n" +
            "Щоб усунути зайвий шум, вентилятори повністю зупиняються, якщо температура графічного процесора опускається нижче 50 °C і рівень енергоспоживання низький.\n" +
            " \n" +
            "Підшипники з подвійними кульками:\n" +
            "Існують різні типи підшипників, і кожен має свої плюси. Підшипники з подвійними кульками забезпечують підвищену надійність і можуть служити в два рази довше, ніж підшипники ковзання.\n" +
            " \n" +
            "Перфорована задня панель:\n" +
            "Вентильована задня панель значно покращує розсіювання тепла, допомагаючи підтримувати низьку температуру графічного процесора при високих навантаженнях. Додатковий потік повітря запобігає перегріву і термічній просадці, підвищуючи продуктивність, стабільність і термін служби пристрою.\n" +
            " \n" +
            "Фазоперехідна термопрокладка для GPU:\n" +
            "Фазоперехідна термопрокладка плавиться при нагріванні і ефективно заповнює зазори між графічним процесором і тепловим модулем, забезпечуючи відмінну теплопередачу і надійне охолодження навіть при серйозних навантаженнях.\n" +
            " \n" +
            "Dual BIOS:\n" +
            "Що для вас важливіше — низька температура або тиша? У режимі «Performance» вентилятори працюють з максимальною швидкістю для кращого охолодження. У режимі «Quiet» зберігаються ті ж параметри потужності та продуктивності, але вентилятори обертаються повільніше, забезпечуючи тишу при помірних температурах. Хочете більше контролю? Використовуйте утиліту GPU Tweak III, щоб точно налаштувати профілі вентиляторів і параметри продуктивності.\n" +
            " \n" +
            "Технологія Auto−Extreme:\n" +
            "Auto-Extreme — це автоматизований виробничий процес, в якому все паяння виконується за один прохід. Це знижує теплове навантаження на компоненти і виключає використання агресивних хімікатів, що зменшує вплив на навколишнє середовище, знижує енергоспоживання і підвищує надійність кінцевого продукту.","/images/video2.jpg"));
    products.add(new Product(8L, "Термопаста Arctic MX-4 зі шпателем 4 г", "Other", 5, "Найвища теплопровідність Поверхні процесорних мікросхем і підлог кулерів покриті мікроскопічними вм'ятинами. Термопаста ARCTIC MX-4 складається з мікрочастинок вуглецю, що заповнюють ці порожнини. Це сприяє надзвичайно високій теплопровідності, гарантуючи швидке й ефективне відведення тепла від процесора або графічного процесора. Завдяки своїй видатній продуктивності MX-4 є чудовим вибором не тільки для оверклокерів і ентузіастів, але й для інших застосунків, що вимагають передавання тепла.\n" +
            "\n" +
            "MX-4 без сумніву доводить, що чудова продуктивність не обов'язково вимагає високої ціни. Просте застосування Завдяки своїй консистенції, MX-4 легко наноситься навіть новачками. Безпечне використання На відміну від паст на основі оксидів металів або рідкого металу, MX-4 від ARCTIC не містить металів і не проводить електрику. Це усуває ризик короткого замикання й позбавляє потреби турбуватися про корозійні ушкодження підлоги радіатора, викликані рідким металом. Підтверджена якість Хоча паковання нашої термопасти змінювалося кілька разів за ці роки, склад формули залишився колишнім. Наші пасти MX давно втілюють високу ефективність і якість, і за допомогою нашого нового перероблюваного паковання ми прагнемо скоротити викиди CO2 і в такий спосіб зробити свій внесок у довкілля.","/images/pasta1.jpg"));
    products.add(new Product(9L, "Gigabyte B850M EAGLE WIFI6E", "Mother", 157, "\n" +
            "Неперевершена продуктивність:\n" +
            "З огляду на стрімкі технологічні зміни, GIGABYTE завжди слідує останнім тенденціям і надає клієнтам передові функції та новітні технології. Материнські плати GIGABYTE оснащені модернізованим рішенням щодо живлення, новітніми стандартами зберігання даних та відмінними можливостями підключення, що забезпечує оптимальну продуктивність для ігор.\n" +
            "\n" +
            "Видатний тепловий дизайн:\n" +
            "Неперевершена продуктивність материнських плат GIGABYTE гарантується інноваційним та оптимізованим тепловим дизайном, що забезпечує найкращу стабільність процесора, набору мікросхем, твердотільних накопичувачів та низькі температури при повному завантаженні додатків та продуктивності в іграх.\n" +
            "\n" +
            "Підключення:\n" +
            "Материнські плати GIGABYTE забезпечують неперевершені можливості підключення завдяки блискавичній швидкості передачі даних через мережу нового покоління, сховище та підключення Wi-Fi.\n" +
            "\n" +
            "Персоналізація:\n" +
            "Материнські плати GIGABYTE поставляються в комплекті з декількома корисними та інтуїтивно зрозумілими програмами, що допомагають користувачам контролювати кожен аспект материнської плати та забезпечують світловий ефект, що налаштовується, з видатною естетикою, щоб відповідати вашій унікальній індивідуальності.\n" +
            "\n" +
            "Ультра міцний:\n" +
            "Конструкція GIGABYTE Ultra Durable забезпечує довговічність продукту та високу якість виробничого процесу. Материнські плати GIGABYTE використовують найкращі компоненти та підсилюють кожен слот, щоб зробити кожен з них міцним та довговічним.","/images/mama2.jpg"));
    products.add(new Product(9L, "Kingston FURY DDR5-6000 32768MB PC5-48000 (Kit of 2x16384)", "RAM", 340, "Оперативна пам’ять Kingston FURY Beast DDR5 – революційне рішення для геймерів й ентузіастів ПК, що прагнуть удосконалити свої ігрові та професійні системи. Завдяки неймовірній швидкості, високій ємності й надійності, пам’ять FURY Beast DDR5 здатна значно підвищити якість та комфорт ігрового процесу, покращити ефективність роботи з професійними програмами та відкрити нові обрії у сфері прискорення комп’ютерних систем. Для забезпечення додаткової ефективності й стабільності роботи на екстремальних швидкостях, доступ до модулів DDR5 організований через два 32-бітних підканала, чіпи пам'яті мають функцію ECC корекції помилок на кристалі ECC (ODECC), а самі модулі оснащені бортовим контуром керування живленням (PMIC)\n" +
            "Завдяки подвоєнню кількості банків, із 16 до 32, та довжини пакета, із 8 до 16, DDR5 пам'ять забезпечує підвищення швидкості обміну даними та виводять на новий рівень продуктивність систем в іграх та роботі з професійними застосунками.\n" +
            "Завдяки революційній продуктивності, пам’ять Kingston FURY Beast DDR5 здатна значно розширити можливості систем в іграх на екстремальних налаштуваннях, підвищити швидкість рендерингу, масштабування анімації та прямих трансляцій 4k+, а інноваційний дизайн модулів підкреслить особистий стиль і характер їх власника.\n" +
            "Завдяки Intel XMP 3.0 або AMD EXPO, двом новим специфікаціям розгону DDR5, які містять індивідуальні профілі швидкостей і таймінгів, пам’ять Kingston FURY Beast DDR5 стає ідеальним рішенням для розгону вашої системи.","/images/ope2.jpg"));
    products.add(new Product(10L, "Клавіатура дротова RZTK KB 120 USB", "Periphery", 5, "RZTK KB 120 — надійна й ергономічна дротова клавіатура, призначена для зручного введення інформації в комп'ютер. Ця модель підійде для дому та офісу.","/images/klava1.jpg"));
    products.add(new Product(11L,"Геймерське Крісло Розкладне до 120 кг Комп'ютерне Ігрове Крісло для Геймера з Подушкою Bonro GT", "Periphery", 85, "\n" +
            "Геймерське Крісло Розкладне до 120 кг Комп'ютерне Ігрове Крісло для Геймера з Подушкою Bonro GT Чорне\n" +
            "\n" +
            "Якщо Вам потрібне недороге рішення, завдяки якому Ви зможете зробити роботу за комп'ютером комфортнішою, модель ігрового крісла Bonro GT ідеально підходить для повсякденних завдань.\n" +
            "\n" +
            "Основною перевагою представленого крісла є не тільки стильний дизайн, але й зручність забезпечена ергономічним профилем и широким діапазоном параметрів. Ця модель чудово підходить для тих, хто проводить багато часу за комп'ютером.","/images/krislo1.jpg"));
    products.add(new Product(12L, "Intel Core i7-3770", "CPU", 43, "\n" +
            "\n" +
            "Підвищте обчислювальну потужність вашого ПК з процесором Intel Core i7-3770! Цей чотириядерний процесор з підтримкою Hyper-Threading забезпечить відмінну продуктивність у іграх і при багатозадачній роботі.", "/images/cpu1.jpg"));
    products.add(new Product(13L, "ASUS PCI-Ex GeForce RTX 3050 Dual OC Edition 6GB GDDR6", "GPU", 238, "SUS Dual GeForce RTX 3050 OC Edition 6 ГБ GDDR6 з двома потужними вентиляторами — ігрова продуктивність AAA-класу та трасування променів.\n" +
            "\n" +
            "Потокові мультипроцесори NVIDIA Ampere: абсолютно новий SM-модуль Ampere забезпечує удвічі більшу пропускну здатність FP32 та покращену енергоефективність.\n" +
            "\n" +
            "RT-ядра 2-го покоління: у два рази більша пропускна здатність порівняно з ядрами 1-го покоління, а також одночасна робота з RT і затіненням — для виняткової продуктивності трасування променів.\n" +
            "\n" +
            "Тензорні ядра 3-го покоління: збільшення пропускної здатності вдвічі завдяки структурній розрідженості та вдосконаленим алгоритмам ШІ, таким як DLSS. Ці ядра забезпечують суттєве зростання продуктивності в іграх та нові можливості для штучного інтелекту.\n" +
            "\n" +
            "OC-версія: тактова частота 1537 МГц (режим OC) / 1507 МГц (режим за замовчуванням).\n" +
            "\n" +
            "Захист від пилу за стандартом IP5X забезпечує довговічність компонентів завдяки перешкоджанню потраплянню частинок.\n" +
            "\n" +
            "Двослотова конструкція максимізує сумісність та ефективність охолодження — ідеально для компактних корпусів.\n" +
            "\n" +
            "Кронштейн із нержавіючої сталі — міцний і стійкий до корозії.\n" +
            "\n" +
            "Технологія Auto-Extreme використовує автоматизацію для підвищення надійності.\n" +
            "\n" +
            "GPU Tweak III забезпечує інтуїтивне налаштування продуктивності, контроль температури та моніторинг системи.", "/images/video3.jpg"));
    products.add(new Product(14L, "Asus PCI-Ex Radeon RX 7600 Dual EVO OC Edition 8GB GDDR6","GPU", 340, "\n" +
            "RX 7600 забезпечує неперевершені ігрові можливості та неперевершену продуктивність.\n" +
            "\n" +
            "Підтримка PCI-E 4.0:\n" +
            "Radeon RX 7600 підтримує PCI-Express 4.0 з пропускною здатністю 16 Гбіт/с та забезпечує подвоєну пропускну здатність, порівнюючи з PCI Express 3.0. З підтримкою материнської плати PCI-Express 4.0 і будьте готові до наступного покоління ігор на ПК.\n" +
            "\n" +
            "Нова архітектура RDNA:\n" +
            "Radeon RX 7600 обладнана новими обчислювальними блоками, новими інструкціями та багаторівневою ієрархією кеша для чималого скорочення затримок і високої продуктивності ігор.","/images/video4.jpg"));
    products.add(new Product(15L, "GameMax GM-500B", "PSU", 25,"\n" +
            "GM-500B від GameMax — універсальний і надійний блок живлення потужністю 500 Вт, який відповідає сучасним потребам персональних комп'ютерних систем.\n" +
            "\n" +
            "Він забезпечить високу надійність і ефективність поряд із тихою роботою — найкраща комбінація характеристик, продуктивності та якості у своєму класі за чудовою ціною.\n" +
            "\n" +
            "В елементній базі блока живлення застосовано надійні та довговічні конденсатори, а для запобігання виходу блока живлення з ладу використовується безліч різних технологій захисту.","/images/block1.jpg"));
    products.add(new Product(16L,"ID-Cooling Frozn A400 Black","Cooling",17,"FROZN A400 black має один вертикальний блок з 4 тепловими трубками та одним 92-міліметровим ШІМ-вентилятором, який забезпечує бездоганне відведення тепла від ЦП. Класичний дизайн з однорідним чорним оформленням пасує до будь-якої збірки ПК.","/images/cool1.jpg"));
    products.add(new Product(17L,"ID-Cooling SE-903-XT","Cooling",13,"\n" +
            "Сокети, що підтримуються: Intel: 1700/1200/1151/1150/1155/1156, AMD: AM5/AM4 \n" +
            "\n" +
            "Розсіювана потужність: 130 Вт. \n" +
            "\n" +
            "Роз'єм для підключення вентиляторів - 4-pin. \n" +
            "\n" +
            "Максимальна швидкість обертання - 2200 об/хв","/images/cool2.jpg"));
    products.add(new Product(18L,"DeepCool AK400 Black","Cooling",31,"\n" +
            "DeepCool AK400 — це кулер для процесора з високим рівнем сумісності з різними платформами, що вирізняється класичною баштовою компоновкою з чотирма тепловими трубками, унікальною конструкцією матричних ребер і високопродуктивним вентилятором FDB, який забезпечує відмінне розсіювання тепла та надзвичайно низький рівень шуму.\n" +
            "\n" +
            "Завдяки здатності ефективно розсіювати тепло до 220 Вт, ефективність охолодження AK400 на сучасних процесорах робить його ідеальним вибором для масових систем, що потребують ідеального співвідношення ціни та продуктивності. Чотири мідні теплові трубки з прямим контактом швидко й ефективно відводять тепло від процесора та розсіюють його через башту радіатора з унікальною конструкцією масиву алюмінієвих ребер.\n" +
            "\n" +
            "Забезпечте ефективне охолодження з мінімальним рівнем шуму завдяки вентилятору з високими експлуатаційними характеристиками, який керується PWM. Завдяки цьому повітряний потік разом зі статичним тиском автоматично регулюються залежно від навантаження на процесор, щоб досягти найкращих показників співвідношення шум/продуктивність.\n" +
            "\n" +
            "Метод встановлення спрощено завдяки міцному суцільнометалевому монтажному кронштейну та швидкому п’ятиетапному процесу безпечного кріплення кулера на нових сокетах Intel і AMD.","/images/cool3.jpg"));
    products.add(new Product(19L,"Кабель Vention HDMI-HDMI, 1 м v2.0 (AACBF)","Other",4,"\n" +
            "Кабель Vention HDMI-HDMI, v2.0 with Ethernet 19M/19M – це цифровий кабель для підключення джерела відеосигналу та пристрою відображення. Канал Ethernet дозволяє кільком пристроям працювати в мережі Ethernet без необхідності підключення додаткових проводів, а також безпосередньо обмінюватися контентом, на швидкості до 100 Мбіт/сек. Кабель має пропускну здатність до 18 Гб/сек, 3D-можливості, а також підтримку більш ніж 8 аудіо каналів. Наявність зворотного каналу аудіо усуває необхідність в окремому дроті для передачі звуку в ресивер з телевізора або іншого пристрою, який є джерелом аудіо і відео.","/images/kabel1.jpg"));
    products.add(new Product(20L,"Asus ROG Strix 1200P Gaming","PSU",250,"ROG Strix 1200W Platinum – це блок живлення, що працює тихо й при низьких температурах, забезпечуючи стабільне енергопостачання. Він спроєктований з урахуванням високої енергоефективності, обладнаний транзисторами MOSFET типу GaN та інтелектуальним стабілізатором, а також вирізняється стильним дизайном.\n" +
            "\n" +
            "Транзистори MOSFET типу GaN забезпечують на 30% вищу енергоефективність і більш впорядковану внутрішню конструкцію, що сприяє зниженню робочої температури.\n" +
            "\n" +
            "Датчик напруги «GPU-FIRST» з запатентованим інтелектуальним стабілізатором збільшує подачу напруги до відеокарти навіть на 45%, що забезпечує кращу плавність ігор і стабільно високу продуктивність.\n" +
            "\n" +
            "Великі радіатори ROG охоплюють найважливіші компоненти, забезпечуючи нижчу температуру й менший рівень шуму в порівнянні з аналогічними рішеннями.\n" +
            "\n" +
            "Подвійний кульковий підшипник вентилятора гарантує удвічі довший термін служби порівняно з підшипником ковзання.\n" +
            "\n" +
            "Технологія 0dB дозволяє насолоджуватися менш вимогливими іграми у майже повній тиші.\n" +
            "\n" +
            "Сумісність з ATX 3.1: ROG Strix Platinum відповідає стандарту ATX 3.1, що гарантує кращу стабільність напруги та струму.\n" +
            "\n" +
            "Підтримка PCIe 5.1: блок живлення ROG Strix Platinum має вбудований роз’єм 12 V-2x6 для живлення відеокарт нового покоління.\n" +
            "\n" +
            "Сертифікат Lambda A: підтверджено низький рівень шуму – менше ніж 25 дБ.\n" +
            "\n" +
            "Сертифікати 80 PLUS & Cybenetics Platinum: ROG Strix Platinum використовує конденсатори з низьким ESR і компоненти преміум-класу, щоб забезпечити найвищу енергоефективність у галузі", "/images/block2.jpg"));
    products.add(new Product(21L,"INTEL Pentium G6400","CPU",88,"\n" +
            "Процесор для щоденних завдань\n" +
            "Процесор Intel Pentium G6400, що ідеально підходить для домашніх користувачів і офісних працівників, пропонує стабільну продуктивність та енергоефективність.\n" +
            "Основні характеристики\n" +
            "З двома ядрами та чотирма потоками, що працюють на частоті 4.0 ГГц, цей процесор забезпечує достатню потужність для багатозадачності. Він оснащений 4 МБ кеш-пам'яті Intel Smart Cache та має тепловий пакет (TDP) в 58 Вт, що робить його економічним рішенням.\n" +
            "Технології та переваги\n" +
            "Підтримка оперативної пам'яті DDR4 до 128 ГБ і частотою до 2666 МГц дозволяє справлятися з більшістю щоденних завдань. Інтегроване графічне ядро Intel UHD Graphics 610 забезпечує базову графіку з частотою до 1.05 ГГц, що достатньо для перегляду відео та простих графічних додатків.\n" +
            "Інтерфейси та сумісність\n" +
            "Процесор сумісний з сокетом s1200 та підтримує PCI Express 3.0 x16, надаючи гнучкість у виборі материнської плати та компонентів.\n" +
            "Ідеально для дому та офісу\n" +
            "Цей процесор чудово підходить для офісних застосунків, інтернет-серфінгу та мультимедійних розваг.\n" +
            "Чому варто обрати цей процесор?\n" +
            "Обираючи Intel Pentium G6400, ви отримуєте надійне рішення для щоденних завдань за доступною ціною, з трирічною гарантією якості.","/images/cpu3.jpg"));
    products.add(new Product(22L,"Kingston Fury Beast DDR5-6000 RGB 32768MB PC5-48000 (Kit of 2x16384) White","RAM",530,"Kingston FURY Beast DDR5 RGB¹ не тільки дає змогу розганяти пам’ять на ігрових платформах нового покоління завдяки передовим технологіям, а й має стильний вигляд. Скористайтеся перевагами надшвидкої пам’яті DDR5 із подвоєною кількістю банків і подвоєною довжиною пакету.\n" +
            "Яскраве RGB-підсвітлення, яке можна налаштувати за допомогою програмного забезпечення Kingston FURY CTRL з запатентованою технологією Infrared Sync Technology, і новий дизайн тепловідводу чорного або білого кольору дають змогу залишатися в центрі уваги як у грі, так і поза нею.\n" +
            "Kingston FURY Beast DDR5 RGB підтримує опції Intel XMP 3.0 або AMD EXPO, дві нові специфікації розгону DDR5, які містять індивідуальні профілі швидкостей і таймінгів. Усі сто процентів пам’яті проходять тестування на робочій швидкості та супроводжуються обмеженою пожиттєвою гарантією.","/images/ope3.jpg"));
    products.add(new Product(23L,"ASUS TUF-RTX3060TI-O8G-V2-GAMING","GPU",354,"ASUS TUF-RTX3060TI-O8G-V2-GAMING - ігрова відеокарта середнього рівня в лінійці компанії NVIDIA за 2020 рік. Вона виготовляється на основі графічних чіпів з новою архітектурою Ampere, що отримала велику кількість поліпшень і оптимізацій. \n" +
            "\n" +
            "В ASUS TUF-RTX3060TI-O8G-V2-GAMING застосовуються RT ядра другого покоління і тензорні ядра третього покоління. Слід зазначити, що оновлена версія отримала обмеження на майнінг криптовалют. \n" +
            "\n" +
            "Завдяки заводському розгону відеокарта здатна працювати на частоті до 1785 МГц, радуючи цілком високим рівнем продуктивності в сучасних іграх і ресурсномістких завданнях. \n" +
            "\n" +
            "Відеопам'яті GDDR6 в ній встановлюється 8 ГБ. Ефективне охолодження навіть при максимальному навантаженні досягається зусиллями продуманої системи з масивним радіатором і вентиляторами Axial-tech. Трохи додати індивідуальності ASUS TUF-RTX3060TI-O8G-V2-GAMING дозволяє настроювана RGB підсвітка логотипу.","/images/video5.jpg"));
    products.add(new Product(24L,"Asus Rog Loki SFX-L 850W Platinum White Edition","PSU",246,"Цей геймерський блок живлення потужністю 850 Вт (модель 90YE00N2-B0NA00) поєднує в собі високу ефективність та компактні габарити, пропонуючи повністю модульну систему підключення кабелів. Пристрій оснащений активною системою охолодження з 120-мм вентилятором, який підтримує інтелектуальне керування швидкістю (AFC) та функцію повної зупинки при низьких навантаженнях для максимальної тиші.\n" +
            "\n" +
            "Завдяки підтримці сучасного стандарту PCI-E Gen 5 (16-pin) та наявності класичних роз’ємів 6+2pin, блок ідеально підходить для потужних відеокарт останніх поколінь. Надійність експлуатації підтверджується повним спектром технологій захисту (від перегріву, короткого замикання та перепадів напруги), активним коректором коефіцієнта потужності (PFC) та вражаючою офіційною гарантією терміном на 10 років.","/images/block3.jpg"));
    products.add(new Product(25L,"Вологі серветки Patron для очищення офісної техніки","Other",1.5,"\n" +
            "Серветки для очищення оргтехніки, туба 100 шт. Patron (F3-028)\n" +
            "\n" +
            "Високоякісні вологі серветки Patron для очищення комп'ютерів, телефонів, клавіатур, мишок, іншого офісного обладнання, пластикових і металевих поверхонь. М'які серветки оптимально просочені очисним розчином, забезпечують ідеальне очищення без розводів і не потребують часу на висихання. Ефективно видаляють плями, відбитки пальців, пил.\n" +
            "\n" +
            "Не використовувати для очищення екранів!\n" +
            "\n" +
            "Перед застосуванням зверніться до інструкції з експлуатації обладнання!\n" +
            "\n" +
            "Застосування: витягніть центральну серветку через отвір в кришці. Протріть поверхню, яку необхідно очистити. Після використання щільно закрийте кришку туби.\n" +
            "\n" +
            "Не містять спирту та ароматизаторів, нешкідливі для шкіри.\n" +
            "\n" +
            "У тубі 100 серветок розміром 13 х 14 см.", "/images/sa1.jpg"));
    products.add(new Product(26L,"Gigabyte B550M Aorus Elite","Mother",101,"\n" +
            "Цифровий VRM-модуль на базі силових МОП-транзисторів Low RDS (on), схема живлення 5 + 3 фази\n" +
            "Підсистема живлення материнських плат Gigabyte сімейства AORUS у складі цифрового PWM-контролера та силових МОН-транзисторів Low RDS (on) організована за схемою 5 + 3 фази, забезпечує гарантовану працездатність процесорів AMD Ryzen 3-го покоління й інших енергоємних компонентів материнської плати, а також підвищену продуктивність і апаратну масштабованість платформи загалом.\n" +
            "\n" +
            "Два M.2 роз'єми для NVMe PCIe 4.0/3.0 накопичувачів:\n" +
            "Завдяки вбудованим M.2-роз'ємів NVMe PCIe 4.0 / 3.0 x4 і PCIe 3.0 x2 материнські плати Gigabyte надають користувачам можливість під'єднати до системи твердотілі NVMe PCIe або SATA-накопичувачі (максимальна пропускна здатність до 64 Гбіт/с). Залучивши обидва роз'єми M.2, можна організувати ідеальне високошвидкісне сховище даних, зокрема й засобами доступного RAID-масиву.\n" +
            "\n" +
            "Ексклюзивний ігровий контролер Realtek RTL8118AS:\n" +
            "Високошвидкісний канал Gigabit LAN і автоматичний розподіл трафіку\n" +
            "Мікросхема Realtek RTL8118 GbE LAN — це високопродуктивний мережевий контролер для ігрових ПК, наділений можливістю автоматично розподіляти ресурси смуги пропускання мережевого інтерфейсу, для забезпечення найвищого пріоритету для призначеного застосунку, зокрема й ігрового. Контролер має всі популярні функції, завдяки яким робота в інтернеті стає продуктивною й безпечною.\n" +
            "\n" +
            "Роз'єм HDMI 2.1 для 4K/60P/21:9/захист контенту HDCP 2.3:\n" +
            "HDMI 2.1 — це мультимедійний інтерфейс високої чіткості, обернено сумісний із версіями HDMI 2.0/1.4, який забезпечує одночасне передання засобами одного кабелю відеосигналу зі швидкістю до 48 Гбіт/с (вдвічі швидше інтерфейсу попереднього покоління). Засобами інтерфейсу можна одночасно передавати кілька відеопотоків в оригінальному для кінематографа форматі 21:9 (в зазначеному співвідношенні сторін знімається більшість фільмів), підтримуються технології Full HDR і HDCP 2.3 і забезпечується найкраще візуальне сприйняття медіаконтенту.\n" +
            "\n" +
            "Індустріальний стандарт для захисту LAN-портів від статичної електрики та пробою:\n" +
            "Для захисту від електростатики в материнських платах Gigabyte застосовуються мікросхеми, запас міцності яких у тричі вищий за типові ІС. Це допомагає надійно захистити материнську плату та її компоненти від пошкоджень, викликаних статичною електрикою. Материнські плати Gigabyte також обладнані спеціальними мікросхемами, які забезпечують захист материнської плати й ПК загалом від перенапруг і перевищення потужності в разі перебоїв з електроживленням." +
            "Smart Fan 5\n" +
            "Завдяки Smart Fan 5 користувачі можуть бути впевнені в тому, що їхній ігровий ПК буде функціонувати в найбільш сприятливому температурному режимі без шкоди для продуктивності. Завдяки термодатчикам, що розміщені на материнській платі, засобами Smart Fan 5 можна контролювати роботу кожного вентилятора. Окрім того, Smart Fan 5 — це ще й більша кількість гібридних роз'ємів для під'єднання вентиляторів, які підтримують режими роботи PWM і Voltage, забезпечуючи максимальну зручність обслуговування встановленої рідинної системи охолодження.\n" +
            "\n" +
            "Fan Stop:\n" +
            "Прихильникам тиші! Завдяки функції Fan Stop вентилятор повністю зупиниться того моменту, коли температура виявиться нижче зазначеного порогового значення. Який саме вентилятор має зупинитися на підставі показань обраного датчика та за якої саме температури, — все це користувач зможе налаштувати, зважаючи на власні вподобання.\n" +
            "\n" +
            "Застосунок RGB Fusion 2.0:\n" +
            "Функціональні можливості програми RGB Fusion 2.0 на материнських платах Gigabyte B550-серії, стосовно адресовних світлодіодних лінійок, розкриваються в повному обсязі. З допомогою фірмового застосунку RGB Fusion 2.0 можна вибирати режими й керувати підсвіткою ПК, реалізованою засобами вбудованих RGB- і зовнішніх адресованих світлодіодних RGB-лінійок. Можливість вибору кольорової гами та активації готових шаблонів у RGB Fusion 2.0 була наявна й раніше, тепер істотно перероблена опція керування лінійками з адресованими світлодіодами. Для кожного світлодіода такої лінійки можна залучити цифрову адресацію, що дає змогу дістати внаслідок цього унікальну кольорову палітру світіння, формувати стилі та нові оригінальні варіанти підсвітки.\n" +
            "\n" +
            "Материнські плати Gigabyte B550-серії готові до роботи із зовнішніми адресованими світлодіодними лінійками з напругою живлення до 5 В (до 300 світлодіодів у лінійці). Для організації підсвічування засобами адресованих світлодіодних лінійок з допомогою програми RGB Fusion 2.0 можна залучити нові шаблони та варіювати численні параметри вибраного режиму світіння.\n" +
            "\n" +
            "RGB Fusion 2.0\n" +
            "Інтуїтивно зрозумілий інтерфейс і розширений функціонал застосунку RGB Fusion 2.0 дають нагоду швидко та максимально ефективно налаштувати підсвітку будь-якого сумісного з цією технологією пристрою. Об'єднуйте в одну схему підсвічування материнську плату та графічний 3D-прискорювач, периферійні пристрої та інші компоненти, надайте вашому ігровому ПК унікального неповторного вигляду й поділіться персональними профілями з друзями. Новий режим підсвітки <Гра> дає змогу застосувати доступні світлові ефекти до обраних ігрових застосунків, допомагаючи зробити розваги на ПК ще інтерактивнішими та придбати неоціненний ігровий досвід.\n" +
            "\n" +
            "High-End аудіоконденсатори:\n" +
            "На материнських платах Gigabyte встановлюються аудіоконденсатори high-end класу. Такі компоненти дають нагоду із високою правильністю відтворювати генерований сигнал, забезпечуючи чудове звучання й реалістичні спецефекти в іграх.\n" +
            "\n" +
            "Антишумовий екран:\n" +
            "Материнські плати Gigabyte обладнані антишумовим екраном звукової підсистеми, який мінімізує вплив перешкод і наведень на чутливі аналогові компоненти аудіотракта на рівні схемотехніки друкованої плати.\n" +
            "\n" +
            "Кнопка Q-Flash Plus:\n" +
            "Оновлений мікрокод BIOS без ЦП, модулів ОЗП і дискретної графіки\n" +
            "Завдяки фірмовій технології Gigabyte Q-Flash Plus для поновлення мікрокода BIOS вам навіть не потрібно встановлювати в систему процесор, пам'ять, графічну плату та викликати меню BIOS Setup. Просто завантажте із сервера Gigabyte і збережіть на USB флешнакопичувачі актуальну версію BIOS (змініть ім'я збереженого файлу на Gigabyte.bin), а потім натисніть спеціальну кнопку Q-Flash Plus. Трохи терпіння, – й усе готово!\n" +
            "\n" +
            "Суцільнометалеві контакти:\n" +
            "Материнські плати Gigabyte B550-серії обладнані ATX 12 В роз'ємами живлення процесора із суцільнометалевими контактами для забезпечення безперебійної роботи ЦП, зокрема й в умовах підвищеного навантаження.\n" +
            "\n" +
            "Захист від оксидів сірки:\n" +
            "З'єднання сірки в повітрі можуть впливати на планарні компоненти (зокрема, резистори), створюючи хімічні сполуки, що можуть викликати коротке замикання. Якщо це станеться, материнська плата не зможе функціонувати. Встановлюючи резистори, стійкі до впливу оксидів сірки, компанія Gigabyte пропонує якісно новий рівень захисту Ultra Durable своїх виробів.","/images/mama3.jpg"));
    products.add(new Product(27L,"Термопаста ARCTIC MX-7 8 г","Other",7,"\n" +
            "Високопродуктивна термопаста для стабільного охолодження:\n" +
            "\n"+
            "ARCTIC MX-7 ULTIMATE — це сучасна термопаста, створена для ефективного тепловідведення у продуктивних комп’ютерних системах. Вона орієнтована на користувачів, які очікують стабільної роботи процесорів і графічних чипів під тривалим навантаженням, зокрема в ігрових, робочих і професійних конфігураціях. Завдяки оптимізованому складу термопаста формує надійний тепловий контакт між кристалом і системою охолодження.\n" +
            "\n" +
            "Збалансована консистенція та зручне нанесення:\n" +
            "\n"+
            "В’язкість у діапазоні 35 000–38 000 poise забезпечує контрольоване нанесення без розтікання та надмірного тиску. MX-7 рівномірно заповнює мікронерівності поверхонь, створюючи щільний і стабільний теплопровідний шар. Щільність 2,9 г/см³ сприяє збереженню структури пасти протягом усього строку експлуатації без висихання.\n" +
            "\n" +
            "Стабільна робота в екстремальних умовах:\n" +
            "\n"+
            "ARCTIC MX-7 ULTIMATE зберігає свої властивості в широкому температурному діапазоні від −50 до 250 °C. Це дає змогу використовувати її як у повсякденних системах, так і в умовах високого теплового навантаження або розгону, де стабільність термоінтерфейсу має вирішальне значення.\n" +
            "\n" +
            "Електрична безпека компонентів:\n" +
            "\n"+
            "Високий питомий опір на рівні 1,7 × 10¹² Ом·см і пробивна напруга 4,2 кВ/мм забезпечують електричну ізоляцію. Це знижує ризик коротких замикань при випадковому контакті термопасти з елементами навколо сокета або чипа, що особливо важливо для сучасних щільно компонованих плат.\n" +
            "\n" +
            "Універсальне застосування:\n" +
            "\n"+
            "MX-7 ULTIMATE підходить для процесорів, графічних адаптерів, чипсетів та інших компонентів, де потрібен надійний тепловий контакт. Вона сумісна з повітряними та рідинними системами охолодження, залишаючись практичним вибором для складання та обслуговування сучасних ПК.","/images/pasta2.jpg"));
    products.add(new Product(28L,"Intel Core i5-12400F","CPU",158,"Intel Core i5-12400F – процесор для настільних ПК з 6 ядрами, випущений у січні 2022 року. Він входить у лінійку Core i5, використовує архітектуру Alder Lake-S із роз'ємом Socket 1700. Завдяки технології Intel Hyper-Threading кількість ядер фактично подвоєна – до 12 потоків. Core i5-12400F має 18 МБ кешу L3 і працює на частоті 2,5 ГГц за замовчуванням, але може розганятися до 4,4 ГГц залежно від робочого навантаження. Intel виробляє Core i5-12400F на виробничому вузлі 10 нм, кількість транзисторів невідома. Чисельник у Core i5-12400F заблокований, що обмежує його розгінний потенціал.\n" +
            "\n" +
            "Підтримка DDR4/DDR5 та PCI-E 5.0:\n" +
            "При TDP 65 Вт Core i5-12400F споживає своєрідне для сучасного ПК енергоспоживання. Процесор Intel підтримує пам'ять DDR4 та DDR5 з двоканальним інтерфейсом. Для зв'язку з іншими компонентами комп'ютера Core i5-12400F використовує з'єднання PCI-Express Gen 5. Цей процесор не має інтегрованої графіки, вам потрібна окрема відеокарта.\n" +
            "\n" +
            "Технології віртуалізації:\n" +
            "На Core i5-12400F є апаратна віртуалізація, яка значно підвищує продуктивність віртуальних машин. Крім того, підтримується віртуалізація IOMMU (PCI passthrough), завдяки чому гостьові віртуальні машини можуть безпосередньо використовувати апаратне забезпечення хоста. Програми, що використовують розширені векторні розширення (AVX), можуть працювати на цьому процесорі, що підвищує продуктивність програм, що вимагають великих обчислень. Крім AVX, Intel також включає новіший стандарт AVX2, але не AVX-512.","/images/cpu4.jpg"));
    products.add(new Product(29L,"Килимок для миші Holmer 600х300х3 мм Black","Periphery",3,"Hölmer OMP-04 — це універсальний настільний килимок (Desk Mat), який пропонує величезний простір для організації вашого робочого місця. Завдяки розміру 600 х 300 мм, він легко вміщує і клавіатуру, і мишу, забезпечуючи єдність стилю, комфорт та стабільність для обох пристроїв.","/images/kov1.jpg"));
    products.add(new Product(30L,"Миша HATOR Hellyberry HM47 Wireless Black-Violet","Periphery",30,"Миша HATOR Hellyberry Wireless — швидкість, точність та абсолютна свобода\n" +
            "\n" +
            "HATOR Hellyberry (HM47) — це ультралегка ігрова миша, створена для блискавичних реакцій та точного контролю. Вона поєднує в собі мінімальну вагу, ергономічну симетричну форму та сучасні бездротові технології. Це ідеальне рішення для геймерів, які цінують комфорт, мобільність та лаконічний дизайн.\n" +
            "\n" +
            "Ультралегка конструкція: Завдяки надзвичайно малій вазі — всього 47 грамів — миша забезпечує легкість рухів без зайвого навантаження на кисть навіть під час тривалих ігрових сесій.\n" +
            "\n" +
            "Ергономіка та витривалість: Симетрична форма ідеально підходить для різних типів хвату, забезпечуючи стабільний контроль. Корпус із преміальним UV-покриттям приємний на дотик, стійкий до зносу та зберігає охайний вигляд при інтенсивному використанні.\n" +
            "\n" +
            "Три режими підключення: Миша адаптується під будь-який сценарій: швидке бездротове з’єднання 2.4 ГГц для геймінгу, Bluetooth для роботи та мобільних пристроїв, а також дротовий режим USB для безперервної гри.\n" +
            "\n" +
            "Магнітна зарядна док-станція: Заряджання стає максимально зручним — достатньо просто встановити мишу на станцію. Вбудоване RGB-підсвічування док-станції додає стильного акценту ігровому простору.","/images/mous1.jpg"));
    }

    @GetMapping("/products")
    public String getProducts(Model model) {

        List<Product> cpuList = new ArrayList<>();
        List<Product> gpuList = new ArrayList<>();
        List<Product> ramList = new ArrayList<>(); // 🔥 ОЦЕ ТИ ЗАБУВ
        List<Product> otherList = new ArrayList<>();
        List<Product> motherList = new ArrayList<>();
        List<Product> peripheryList = new ArrayList<>();
        List<Product> psuList = new ArrayList<>();
        List<Product> coolingList = new ArrayList<>();

        for (Product p : products) {
            if (p.getCategory().equals("CPU")) cpuList.add(p);
            else if (p.getCategory().equals("GPU")) gpuList.add(p);
            else if (p.getCategory().equals("RAM")) ramList.add(p);
            else if (p.getCategory().equals("Other")) otherList.add(p);
            else if (p.getCategory().equals("Mother")) motherList.add(p);
            else if (p.getCategory().equals("Periphery")) peripheryList.add(p);
            else if (p.getCategory().equals("PSU")) psuList.add(p);
            else if (p.getCategory().equals("Cooling")) coolingList.add(p);
        }

        model.addAttribute("cpuList", cpuList);
        model.addAttribute("gpuList", gpuList);
        model.addAttribute("ramList", ramList);
        model.addAttribute("otherList", otherList);
        model.addAttribute("motherList", motherList);
        model.addAttribute("peripheryList", peripheryList);
        model.addAttribute("psuList", psuList);
        model.addAttribute("coolingList", coolingList);

        return "products";
    }

    @GetMapping("/periphery")
    public String getPeriphery(Model model) {
        List<Product> products = getAllProducts();

        List<Product> peripheryList = new ArrayList<>();

        for (Product p : products) {
            if ("Periphery".equals(p.getCategory())) {
                peripheryList.add(p);
            }
        }

        model.addAttribute("peripheryList", peripheryList);
        return "periphery";
    }


    // 🔥 СТОРІНКА ОДНОГО ТОВАРУ
    @GetMapping("/product/{id}")
    public String getProductById(@PathVariable Long id, Model model) {

        Product foundProduct = null;

        for (Product product : products) {
            if (product.getId().equals(id)) {
                foundProduct = product;
                break;
            }
        }

        model.addAttribute("product", foundProduct);
        return "product";
    }
}