package com.example.showroom.controller;

import com.example.showroom.model.Product;
import org.springframework.stereotype.Controller;
import org.springframework.ui.Model;
import org.springframework.web.bind.annotation.*;

import java.util.ArrayList;
import java.util.List;

@Controller
public class ProductController {

    public List<Product> getAllProducts() {
        return products;
    }
    private List<Product> products = new ArrayList<>();

    public ProductController() {
        products.add(new Product(1L, "Intel Core i5-14400F", "CPU", 200, "\n" +
                "Процесор Intel Core 14-го покоління для настільних ПК з розблокованим множником оптимізовано для ентузіастів-геймерів та серйозних творців.\n" +
                "\n" +
                "Сумісність з материнськими платами з урахуванням чіпсетів серії 700/600.", "/images/cpu2.jpg"));

        products.add(new Product(2L, "ASUS PCI-Ex GeForce RTX 3060 Dual OC V2 LHR 12GB GDDR6 ", "GPU", 535, "Ця відеокарта є Limited Hash Rate версією — обладнана апаратним обмежувачем майнінгу Ethereum.\n" +
                "\n" +
                "Мікроархітектура NVIDIA Ampere:\n" +
                "Нова мікроархітектура NVIDIA Ampere виводить гру на новий рівень завдяки поліпшеним функційним блокам, включно з RT-ядрами другого покоління й тензорними ядрами третього покоління.\n" +
                "\n" +
                "Вмикаємо RTX!:\n" +
                "Фантастичний реалізм і висока швидкість, що стали можливими завдяки технологіям трасування променів і штучного інтелекту, — в іграх нового покоління!\n" +
                "\n" +
                "Технологія DLSS:\n" +
                "Технологія згладжування з алгоритмами глибокого навчання NVIDIA DLSS забезпечує безкомпромісну якість зображення завдяки використанню наявних у відеокартах GeForce RTX тензорних ядер. Водночас вона мало впливає на швидкість гри, що дасть змогу викрутити настроювання на максимум. Штучний інтелект — на службі в геймерів!\n" +
                "\n" +
                "Платформа для творчості:\n" +
                "Відеокарти серії GeForce RTX 30 підходять не лише для ігор, але й для продуктивної роботи. Підтримка технологій штучного інтелекту, сумісність із програмною платформою NVIDIA Studio і висока продуктивність роблять їх чудовим вибором для тривимірного моделювання, редагування відеоматеріалів у форматі 8K або стримінга в прямому ефірі.", "/images/video1.jpg"));
        products.add(new Product(3L, "Kingston Fury SODIMM DDR4-3200 16384 MB PC4-25600 Impact Black", "RAM", 137, "Високошвидкісні модулі пам’яті SODIMM, створені спеціально для підвищення продуктивності й зниження системних затримок в ноутбуках та ПК компактних форм-факторів, дозволяють значно прискорити роботу й зменшити енергоспоживання систем в іграх та професійних ресурсомістких програмах — оптимальне рішення для оновлення компактних систем на основі процесорів Intel або AMD.\n" +
                "Переваги:\n" +
                "Висока продуктивність з підтримкою автоматичного розгону Plug N Play\n" +
                "Сумісність з Intel XMP та AMD Ryzen\n" +
                "Компактний форм-фактор\n" +
                "Висока енергоефективність\n" +
                "Широкий діапазон ємностей", "/images/ope1.jpg"));
        products.add(new Product(4L, "Миша Logitech G102 Lightsync USB Black", "Periphery", 27, "Ця ігрова миша поєднує в собі класичний шестикнопковий дизайн із передовими технологіями, пропонуючи датчик ігрового класу з регульованою чутливістю від 200 до 8000 DPI. Головною особливістю є інтелектуальна RGB-підсвітка LIGHTSYNC, яка підтримує 16,8 млн відтінків та здатна динамічно синхронізуватися з подіями на екрані або ритмом музики.\n" +
                "\n" +
                "Завдяки фірмовому ПЗ Logitech G HUB, користувачі можуть повністю персоналізувати пристрій: від створення унікальних профілів підсвітки до програмування клавіш під ігрові команди. Надійність та приємний відгук забезпечує оптимізований механізм кнопок із металевими пружинами, що гарантує стабільне та чітке спрацьовування в кожному раунді.","/images/mouss.jpg"));
        products.add(new Product(5L, "TUF Gaming B850-PLUS","Mother", 250, "\n" +
                "ASUS TUF GAMING B850-PLUS WIFI увібрала в себе всі основні елементи новітніх процесорів AMD Ryzen і поєднала їх з ігровими функціями та перевіреною довговічністю. Завдяки компонентам військового класу, модернізованій системі живлення та комплексній системі охолодження ця материнська плата перевершує всі очікування, забезпечуючи надійну та стабільну продуктивність для марафонських ігор. Материнські плати TUF GAMING також проходять суворі випробування на витривалість, щоб гарантувати, що вони зможуть впоратися з умовами, в яких інші можуть зазнати невдачі. Ця платформа забезпечує потужність і можливості підключення, яких вимагають сучасні програми для ПК зі штучним інтелектом.","/images/mama1.jpg"));
        products.add(new Product(6L,"AMD Ryzen 7 9800X3D", "CPU",500, "\n" +
                "Найшвидший виграє:\n" +
                "Цей найкращий у світі процесор для настільних ПК гарантує чудову продуктивність в іграх.\n" +
                "\n" +
                "Технологія AMD StoreMI:\n" +
                "Простий і швидкий спосіб розширити сховище даних настільного ПК з процесором AMD Ryzen та прискорити його роботу.\n" +
                "\n" +
                "Програма AMD Ryzen Master:\n" +
                "Проста та потужна програма для розгону процесорів AMD Ryzen.\n" +
                "\n" +
                "AMD Ryzen VR-Ready Premium:\n" +
                "Для користувачів, які хочуть отримати максимум задоволення від використання технології віртуальної реальності, компанія AMD пропонує високопродуктивні процесори Ryzen VR-Ready Premium.","/images/proc1.jpg"));
    products.add(new Product(7L, "ASUS PCI-Ex GeForce RTX 5070 Dual OC Edition 12GB GDDR7", "GPU", 755, "\n" +
            "Два вентилятори — ідеальна сумісність\n" +
            "ASUS Dual GeForce RTX 5070 поєднує в собі потужну систему охолодження та широку сумісність. Передові технології охолодження, запозичені у флагманських відеокарт, включаючи два вентилятори Axial-tech, оптимізують повітряний потік до радіатора. Компактний корпус дозволяє отримати максимальну продуктивність при мінімальних габаритах. Ці особливості роблять ASUS Dual відмінним вибором для геймерів, яким потрібна потужна відеокарта в компактній збірці.\n" +
            " \n" +
            "Компактний дизайн з двома вентиляторами:\n" +
            "Ретельно спроєктований кожух, радіатор і теплові трубки дозволяють двом вентиляторам Axial-tech використовувати вентиляцію збоку корпусу, забезпечуючи охолодження, що перевершує можливості типових компактних відеокарт.\n" +
            " \n" +
            "Оновлені вентилятори Axial-tech:\n" +
            "Два перевірених вентилятори Axial-tech зі зменшеною центральною частиною, подовженими лопатями і фіксуючим кільцем забезпечують посилений тиск повітря вниз — для зниження температури, зниження шуму і збільшення продуктивності.\n" +
            " \n" +
            "Технологія 0dB:\n" +
            "Щоб усунути зайвий шум, вентилятори повністю зупиняються, якщо температура графічного процесора опускається нижче 50 °C і рівень енергоспоживання низький.\n" +
            " \n" +
            "Підшипники з подвійними кульками:\n" +
            "Існують різні типи підшипників, і кожен має свої плюси. Підшипники з подвійними кульками забезпечують підвищену надійність і можуть служити в два рази довше, ніж підшипники ковзання.\n" +
            " \n" +
            "Перфорована задня панель:\n" +
            "Вентильована задня панель значно покращує розсіювання тепла, допомагаючи підтримувати низьку температуру графічного процесора при високих навантаженнях. Додатковий потік повітря запобігає перегріву і термічній просадці, підвищуючи продуктивність, стабільність і термін служби пристрою.\n" +
            " \n" +
            "Фазоперехідна термопрокладка для GPU:\n" +
            "Фазоперехідна термопрокладка плавиться при нагріванні і ефективно заповнює зазори між графічним процесором і тепловим модулем, забезпечуючи відмінну теплопередачу і надійне охолодження навіть при серйозних навантаженнях.\n" +
            " \n" +
            "Dual BIOS:\n" +
            "Що для вас важливіше — низька температура або тиша? У режимі «Performance» вентилятори працюють з максимальною швидкістю для кращого охолодження. У режимі «Quiet» зберігаються ті ж параметри потужності та продуктивності, але вентилятори обертаються повільніше, забезпечуючи тишу при помірних температурах. Хочете більше контролю? Використовуйте утиліту GPU Tweak III, щоб точно налаштувати профілі вентиляторів і параметри продуктивності.\n" +
            " \n" +
            "Технологія Auto−Extreme:\n" +
            "Auto-Extreme — це автоматизований виробничий процес, в якому все паяння виконується за один прохід. Це знижує теплове навантаження на компоненти і виключає використання агресивних хімікатів, що зменшує вплив на навколишнє середовище, знижує енергоспоживання і підвищує надійність кінцевого продукту.","/images/video2.jpg"));
    products.add(new Product(8L, "Термопаста Arctic MX-4 зі шпателем 4 г", "Other", 5, "Найвища теплопровідність Поверхні процесорних мікросхем і підлог кулерів покриті мікроскопічними вм'ятинами. Термопаста ARCTIC MX-4 складається з мікрочастинок вуглецю, що заповнюють ці порожнини. Це сприяє надзвичайно високій теплопровідності, гарантуючи швидке й ефективне відведення тепла від процесора або графічного процесора. Завдяки своїй видатній продуктивності MX-4 є чудовим вибором не тільки для оверклокерів і ентузіастів, але й для інших застосунків, що вимагають передавання тепла.\n" +
            "\n" +
            "MX-4 без сумніву доводить, що чудова продуктивність не обов'язково вимагає високої ціни. Просте застосування Завдяки своїй консистенції, MX-4 легко наноситься навіть новачками. Безпечне використання На відміну від паст на основі оксидів металів або рідкого металу, MX-4 від ARCTIC не містить металів і не проводить електрику. Це усуває ризик короткого замикання й позбавляє потреби турбуватися про корозійні ушкодження підлоги радіатора, викликані рідким металом. Підтверджена якість Хоча паковання нашої термопасти змінювалося кілька разів за ці роки, склад формули залишився колишнім. Наші пасти MX давно втілюють високу ефективність і якість, і за допомогою нашого нового перероблюваного паковання ми прагнемо скоротити викиди CO2 і в такий спосіб зробити свій внесок у довкілля.","/images/pasta1.jpg"));
    products.add(new Product(9L, "Gigabyte B850M EAGLE WIFI6E", "Mother", 157, "\n" +
            "Неперевершена продуктивність:\n" +
            "З огляду на стрімкі технологічні зміни, GIGABYTE завжди слідує останнім тенденціям і надає клієнтам передові функції та новітні технології. Материнські плати GIGABYTE оснащені модернізованим рішенням щодо живлення, новітніми стандартами зберігання даних та відмінними можливостями підключення, що забезпечує оптимальну продуктивність для ігор.\n" +
            "\n" +
            "Видатний тепловий дизайн:\n" +
            "Неперевершена продуктивність материнських плат GIGABYTE гарантується інноваційним та оптимізованим тепловим дизайном, що забезпечує найкращу стабільність процесора, набору мікросхем, твердотільних накопичувачів та низькі температури при повному завантаженні додатків та продуктивності в іграх.\n" +
            "\n" +
            "Підключення:\n" +
            "Материнські плати GIGABYTE забезпечують неперевершені можливості підключення завдяки блискавичній швидкості передачі даних через мережу нового покоління, сховище та підключення Wi-Fi.\n" +
            "\n" +
            "Персоналізація:\n" +
            "Материнські плати GIGABYTE поставляються в комплекті з декількома корисними та інтуїтивно зрозумілими програмами, що допомагають користувачам контролювати кожен аспект материнської плати та забезпечують світловий ефект, що налаштовується, з видатною естетикою, щоб відповідати вашій унікальній індивідуальності.\n" +
            "\n" +
            "Ультра міцний:\n" +
            "Конструкція GIGABYTE Ultra Durable забезпечує довговічність продукту та високу якість виробничого процесу. Материнські плати GIGABYTE використовують найкращі компоненти та підсилюють кожен слот, щоб зробити кожен з них міцним та довговічним.","/images/mama2.jpg"));
    products.add(new Product(9L, "Kingston FURY DDR5-6000 32768MB PC5-48000 (Kit of 2x16384)", "RAM", 340, "Оперативна пам’ять Kingston FURY Beast DDR5 – революційне рішення для геймерів й ентузіастів ПК, що прагнуть удосконалити свої ігрові та професійні системи. Завдяки неймовірній швидкості, високій ємності й надійності, пам’ять FURY Beast DDR5 здатна значно підвищити якість та комфорт ігрового процесу, покращити ефективність роботи з професійними програмами та відкрити нові обрії у сфері прискорення комп’ютерних систем. Для забезпечення додаткової ефективності й стабільності роботи на екстремальних швидкостях, доступ до модулів DDR5 організований через два 32-бітних підканала, чіпи пам'яті мають функцію ECC корекції помилок на кристалі ECC (ODECC), а самі модулі оснащені бортовим контуром керування живленням (PMIC)\n" +
            "Завдяки подвоєнню кількості банків, із 16 до 32, та довжини пакета, із 8 до 16, DDR5 пам'ять забезпечує підвищення швидкості обміну даними та виводять на новий рівень продуктивність систем в іграх та роботі з професійними застосунками.\n" +
            "Завдяки революційній продуктивності, пам’ять Kingston FURY Beast DDR5 здатна значно розширити можливості систем в іграх на екстремальних налаштуваннях, підвищити швидкість рендерингу, масштабування анімації та прямих трансляцій 4k+, а інноваційний дизайн модулів підкреслить особистий стиль і характер їх власника.\n" +
            "Завдяки Intel XMP 3.0 або AMD EXPO, двом новим специфікаціям розгону DDR5, які містять індивідуальні профілі швидкостей і таймінгів, пам’ять Kingston FURY Beast DDR5 стає ідеальним рішенням для розгону вашої системи.","/images/ope2.jpg"));
    products.add(new Product(10L, "Клавіатура дротова RZTK KB 120 USB", "Periphery", 5, "RZTK KB 120 — надійна й ергономічна дротова клавіатура, призначена для зручного введення інформації в комп'ютер. Ця модель підійде для дому та офісу.","/images/klava1.jpg"));
    products.add(new Product(11L,"Геймерське Крісло Розкладне до 120 кг Комп'ютерне Ігрове Крісло для Геймера з Подушкою Bonro GT", "Periphery", 85, "\n" +
            "Геймерське Крісло Розкладне до 120 кг Комп'ютерне Ігрове Крісло для Геймера з Подушкою Bonro GT Чорне\n" +
            "\n" +
            "Якщо Вам потрібне недороге рішення, завдяки якому Ви зможете зробити роботу за комп'ютером комфортнішою, модель ігрового крісла Bonro GT ідеально підходить для повсякденних завдань.\n" +
            "\n" +
            "Основною перевагою представленого крісла є не тільки стильний дизайн, але й зручність забезпечена ергономічним профилем и широким діапазоном параметрів. Ця модель чудово підходить для тих, хто проводить багато часу за комп'ютером.","/images/krislo1.jpg"));
    products.add(new Product(12L, "Intel Core i7-3770", "CPU", 43, "\n" +
            "\n" +
            "Підвищте обчислювальну потужність вашого ПК з процесором Intel Core i7-3770! Цей чотириядерний процесор з підтримкою Hyper-Threading забезпечить відмінну продуктивність у іграх і при багатозадачній роботі.", "/images/cpu1.jpg"));
    products.add(new Product(13L, "ASUS PCI-Ex GeForce RTX 3050 Dual OC Edition 6GB GDDR6", "GPU", 238, "SUS Dual GeForce RTX 3050 OC Edition 6 ГБ GDDR6 з двома потужними вентиляторами — ігрова продуктивність AAA-класу та трасування променів.\n" +
            "\n" +
            "Потокові мультипроцесори NVIDIA Ampere: абсолютно новий SM-модуль Ampere забезпечує удвічі більшу пропускну здатність FP32 та покращену енергоефективність.\n" +
            "\n" +
            "RT-ядра 2-го покоління: у два рази більша пропускна здатність порівняно з ядрами 1-го покоління, а також одночасна робота з RT і затіненням — для виняткової продуктивності трасування променів.\n" +
            "\n" +
            "Тензорні ядра 3-го покоління: збільшення пропускної здатності вдвічі завдяки структурній розрідженості та вдосконаленим алгоритмам ШІ, таким як DLSS. Ці ядра забезпечують суттєве зростання продуктивності в іграх та нові можливості для штучного інтелекту.\n" +
            "\n" +
            "OC-версія: тактова частота 1537 МГц (режим OC) / 1507 МГц (режим за замовчуванням).\n" +
            "\n" +
            "Захист від пилу за стандартом IP5X забезпечує довговічність компонентів завдяки перешкоджанню потраплянню частинок.\n" +
            "\n" +
            "Двослотова конструкція максимізує сумісність та ефективність охолодження — ідеально для компактних корпусів.\n" +
            "\n" +
            "Кронштейн із нержавіючої сталі — міцний і стійкий до корозії.\n" +
            "\n" +
            "Технологія Auto-Extreme використовує автоматизацію для підвищення надійності.\n" +
            "\n" +
            "GPU Tweak III забезпечує інтуїтивне налаштування продуктивності, контроль температури та моніторинг системи.", "/images/video3.jpg"));
    products.add(new Product(14L, "Asus PCI-Ex Radeon RX 7600 Dual EVO OC Edition 8GB GDDR6","GPU", 340, "\n" +
            "RX 7600 забезпечує неперевершені ігрові можливості та неперевершену продуктивність.\n" +
            "\n" +
            "Підтримка PCI-E 4.0:\n" +
            "Radeon RX 7600 підтримує PCI-Express 4.0 з пропускною здатністю 16 Гбіт/с та забезпечує подвоєну пропускну здатність, порівнюючи з PCI Express 3.0. З підтримкою материнської плати PCI-Express 4.0 і будьте готові до наступного покоління ігор на ПК.\n" +
            "\n" +
            "Нова архітектура RDNA:\n" +
            "Radeon RX 7600 обладнана новими обчислювальними блоками, новими інструкціями та багаторівневою ієрархією кеша для чималого скорочення затримок і високої продуктивності ігор.","/images/video4.jpg"));
    products.add(new Product(15L, "GameMax GM-500B", "PSU", 25,"\n" +
            "GM-500B від GameMax — універсальний і надійний блок живлення потужністю 500 Вт, який відповідає сучасним потребам персональних комп'ютерних систем.\n" +
            "\n" +
            "Він забезпечить високу надійність і ефективність поряд із тихою роботою — найкраща комбінація характеристик, продуктивності та якості у своєму класі за чудовою ціною.\n" +
            "\n" +
            "В елементній базі блока живлення застосовано надійні та довговічні конденсатори, а для запобігання виходу блока живлення з ладу використовується безліч різних технологій захисту.","/images/block1.jpg"));
    products.add(new Product(16L,"ID-Cooling Frozn A400 Black","Cooling",17,"FROZN A400 black має один вертикальний блок з 4 тепловими трубками та одним 92-міліметровим ШІМ-вентилятором, який забезпечує бездоганне відведення тепла від ЦП. Класичний дизайн з однорідним чорним оформленням пасує до будь-якої збірки ПК.","/images/cool1.jpg"));
    products.add(new Product(17L,"ID-Cooling SE-903-XT","Cooling",13,"\n" +
            "Сокети, що підтримуються: Intel: 1700/1200/1151/1150/1155/1156, AMD: AM5/AM4 \n" +
            "\n" +
            "Розсіювана потужність: 130 Вт. \n" +
            "\n" +
            "Роз'єм для підключення вентиляторів - 4-pin. \n" +
            "\n" +
            "Максимальна швидкість обертання - 2200 об/хв","/images/cool2.jpg"));
    products.add(new Product(18L,"DeepCool AK400 Black","Cooling",31,"\n" +
            "DeepCool AK400 — це кулер для процесора з високим рівнем сумісності з різними платформами, що вирізняється класичною баштовою компоновкою з чотирма тепловими трубками, унікальною конструкцією матричних ребер і високопродуктивним вентилятором FDB, який забезпечує відмінне розсіювання тепла та надзвичайно низький рівень шуму.\n" +
            "\n" +
            "Завдяки здатності ефективно розсіювати тепло до 220 Вт, ефективність охолодження AK400 на сучасних процесорах робить його ідеальним вибором для масових систем, що потребують ідеального співвідношення ціни та продуктивності. Чотири мідні теплові трубки з прямим контактом швидко й ефективно відводять тепло від процесора та розсіюють його через башту радіатора з унікальною конструкцією масиву алюмінієвих ребер.\n" +
            "\n" +
            "Забезпечте ефективне охолодження з мінімальним рівнем шуму завдяки вентилятору з високими експлуатаційними характеристиками, який керується PWM. Завдяки цьому повітряний потік разом зі статичним тиском автоматично регулюються залежно від навантаження на процесор, щоб досягти найкращих показників співвідношення шум/продуктивність.\n" +
            "\n" +
            "Метод встановлення спрощено завдяки міцному суцільнометалевому монтажному кронштейну та швидкому п’ятиетапному процесу безпечного кріплення кулера на нових сокетах Intel і AMD.","/images/cool3.jpg"));
    products.add(new Product(19L,"Кабель Vention HDMI-HDMI, 1 м v2.0 (AACBF)","Other",4,"\n" +
            "Кабель Vention HDMI-HDMI, v2.0 with Ethernet 19M/19M – це цифровий кабель для підключення джерела відеосигналу та пристрою відображення. Канал Ethernet дозволяє кільком пристроям працювати в мережі Ethernet без необхідності підключення додаткових проводів, а також безпосередньо обмінюватися контентом, на швидкості до 100 Мбіт/сек. Кабель має пропускну здатність до 18 Гб/сек, 3D-можливості, а також підтримку більш ніж 8 аудіо каналів. Наявність зворотного каналу аудіо усуває необхідність в окремому дроті для передачі звуку в ресивер з телевізора або іншого пристрою, який є джерелом аудіо і відео.","/images/kabel1.jpg"));
    products.add(new Product(20L,"Asus ROG Strix 1200P Gaming","PSU",250,"ROG Strix 1200W Platinum – це блок живлення, що працює тихо й при низьких температурах, забезпечуючи стабільне енергопостачання. Він спроєктований з урахуванням високої енергоефективності, обладнаний транзисторами MOSFET типу GaN та інтелектуальним стабілізатором, а також вирізняється стильним дизайном.\n" +
            "\n" +
            "Транзистори MOSFET типу GaN забезпечують на 30% вищу енергоефективність і більш впорядковану внутрішню конструкцію, що сприяє зниженню робочої температури.\n" +
            "\n" +
            "Датчик напруги «GPU-FIRST» з запатентованим інтелектуальним стабілізатором збільшує подачу напруги до відеокарти навіть на 45%, що забезпечує кращу плавність ігор і стабільно високу продуктивність.\n" +
            "\n" +
            "Великі радіатори ROG охоплюють найважливіші компоненти, забезпечуючи нижчу температуру й менший рівень шуму в порівнянні з аналогічними рішеннями.\n" +
            "\n" +
            "Подвійний кульковий підшипник вентилятора гарантує удвічі довший термін служби порівняно з підшипником ковзання.\n" +
            "\n" +
            "Технологія 0dB дозволяє насолоджуватися менш вимогливими іграми у майже повній тиші.\n" +
            "\n" +
            "Сумісність з ATX 3.1: ROG Strix Platinum відповідає стандарту ATX 3.1, що гарантує кращу стабільність напруги та струму.\n" +
            "\n" +
            "Підтримка PCIe 5.1: блок живлення ROG Strix Platinum має вбудований роз’єм 12 V-2x6 для живлення відеокарт нового покоління.\n" +
            "\n" +
            "Сертифікат Lambda A: підтверджено низький рівень шуму – менше ніж 25 дБ.\n" +
            "\n" +
            "Сертифікати 80 PLUS & Cybenetics Platinum: ROG Strix Platinum використовує конденсатори з низьким ESR і компоненти преміум-класу, щоб забезпечити найвищу енергоефективність у галузі", "/images/block2.jpg"));
    products.add(new Product(21L,"INTEL Pentium G6400","CPU",88,"\n" +
            "Процесор для щоденних завдань\n" +
            "Процесор Intel Pentium G6400, що ідеально підходить для домашніх користувачів і офісних працівників, пропонує стабільну продуктивність та енергоефективність.\n" +
            "Основні характеристики\n" +
            "З двома ядрами та чотирма потоками, що працюють на частоті 4.0 ГГц, цей процесор забезпечує достатню потужність для багатозадачності. Він оснащений 4 МБ кеш-пам'яті Intel Smart Cache та має тепловий пакет (TDP) в 58 Вт, що робить його економічним рішенням.\n" +
            "Технології та переваги\n" +
            "Підтримка оперативної пам'яті DDR4 до 128 ГБ і частотою до 2666 МГц дозволяє справлятися з більшістю щоденних завдань. Інтегроване графічне ядро Intel UHD Graphics 610 забезпечує базову графіку з частотою до 1.05 ГГц, що достатньо для перегляду відео та простих графічних додатків.\n" +
            "Інтерфейси та сумісність\n" +
            "Процесор сумісний з сокетом s1200 та підтримує PCI Express 3.0 x16, надаючи гнучкість у виборі материнської плати та компонентів.\n" +
            "Ідеально для дому та офісу\n" +
            "Цей процесор чудово підходить для офісних застосунків, інтернет-серфінгу та мультимедійних розваг.\n" +
            "Чому варто обрати цей процесор?\n" +
            "Обираючи Intel Pentium G6400, ви отримуєте надійне рішення для щоденних завдань за доступною ціною, з трирічною гарантією якості.","/images/cpu3.jpg"));
    products.add(new Product(22L,"Kingston Fury Beast DDR5-6000 RGB 32768MB PC5-48000 (Kit of 2x16384) White","RAM",530,"Kingston FURY Beast DDR5 RGB¹ не тільки дає змогу розганяти пам’ять на ігрових платформах нового покоління завдяки передовим технологіям, а й має стильний вигляд. Скористайтеся перевагами надшвидкої пам’яті DDR5 із подвоєною кількістю банків і подвоєною довжиною пакету.\n" +
            "Яскраве RGB-підсвітлення, яке можна налаштувати за допомогою програмного забезпечення Kingston FURY CTRL з запатентованою технологією Infrared Sync Technology, і новий дизайн тепловідводу чорного або білого кольору дають змогу залишатися в центрі уваги як у грі, так і поза нею.\n" +
            "Kingston FURY Beast DDR5 RGB підтримує опції Intel XMP 3.0 або AMD EXPO, дві нові специфікації розгону DDR5, які містять індивідуальні профілі швидкостей і таймінгів. Усі сто процентів пам’яті проходять тестування на робочій швидкості та супроводжуються обмеженою пожиттєвою гарантією.","/images/ope3.jpg"));
    products.add(new Product(23L,"ASUS TUF-RTX3060TI-O8G-V2-GAMING","GPU",354,"ASUS TUF-RTX3060TI-O8G-V2-GAMING - ігрова відеокарта середнього рівня в лінійці компанії NVIDIA за 2020 рік. Вона виготовляється на основі графічних чіпів з новою архітектурою Ampere, що отримала велику кількість поліпшень і оптимізацій. \n" +
            "\n" +
            "В ASUS TUF-RTX3060TI-O8G-V2-GAMING застосовуються RT ядра другого покоління і тензорні ядра третього покоління. Слід зазначити, що оновлена версія отримала обмеження на майнінг криптовалют. \n" +
            "\n" +
            "Завдяки заводському розгону відеокарта здатна працювати на частоті до 1785 МГц, радуючи цілком високим рівнем продуктивності в сучасних іграх і ресурсномістких завданнях. \n" +
            "\n" +
            "Відеопам'яті GDDR6 в ній встановлюється 8 ГБ. Ефективне охолодження навіть при максимальному навантаженні досягається зусиллями продуманої системи з масивним радіатором і вентиляторами Axial-tech. Трохи додати індивідуальності ASUS TUF-RTX3060TI-O8G-V2-GAMING дозволяє настроювана RGB підсвітка логотипу.","/images/video5.jpg"));
    products.add(new Product(24L,"Asus Rog Loki SFX-L 850W Platinum White Edition","PSU",246,"Цей геймерський блок живлення потужністю 850 Вт (модель 90YE00N2-B0NA00) поєднує в собі високу ефективність та компактні габарити, пропонуючи повністю модульну систему підключення кабелів. Пристрій оснащений активною системою охолодження з 120-мм вентилятором, який підтримує інтелектуальне керування швидкістю (AFC) та функцію повної зупинки при низьких навантаженнях для максимальної тиші.\n" +
            "\n" +
            "Завдяки підтримці сучасного стандарту PCI-E Gen 5 (16-pin) та наявності класичних роз’ємів 6+2pin, блок ідеально підходить для потужних відеокарт останніх поколінь. Надійність експлуатації підтверджується повним спектром технологій захисту (від перегріву, короткого замикання та перепадів напруги), активним коректором коефіцієнта потужності (PFC) та вражаючою офіційною гарантією терміном на 10 років.","/images/block3.jpg"));
    products.add(new Product(25L,"Вологі серветки Patron для очищення офісної техніки","Other",1.5,"\n" +
            "Серветки для очищення оргтехніки, туба 100 шт. Patron (F3-028)\n" +
            "\n" +
            "Високоякісні вологі серветки Patron для очищення комп'ютерів, телефонів, клавіатур, мишок, іншого офісного обладнання, пластикових і металевих поверхонь. М'які серветки оптимально просочені очисним розчином, забезпечують ідеальне очищення без розводів і не потребують часу на висихання. Ефективно видаляють плями, відбитки пальців, пил.\n" +
            "\n" +
            "Не використовувати для очищення екранів!\n" +
            "\n" +
            "Перед застосуванням зверніться до інструкції з експлуатації обладнання!\n" +
            "\n" +
            "Застосування: витягніть центральну серветку через отвір в кришці. Протріть поверхню, яку необхідно очистити. Після використання щільно закрийте кришку туби.\n" +
            "\n" +
            "Не містять спирту та ароматизаторів, нешкідливі для шкіри.\n" +
            "\n" +
            "У тубі 100 серветок розміром 13 х 14 см.", "/images/sa1.jpg"));
    products.add(new Product(26L,"Gigabyte B550M Aorus Elite","Mother",101,"\n" +
            "Цифровий VRM-модуль на базі силових МОП-транзисторів Low RDS (on), схема живлення 5 + 3 фази\n" +
            "Підсистема живлення материнських плат Gigabyte сімейства AORUS у складі цифрового PWM-контролера та силових МОН-транзисторів Low RDS (on) організована за схемою 5 + 3 фази, забезпечує гарантовану працездатність процесорів AMD Ryzen 3-го покоління й інших енергоємних компонентів материнської плати, а також підвищену продуктивність і апаратну масштабованість платформи загалом.\n" +
            "\n" +
            "Два M.2 роз'єми для NVMe PCIe 4.0/3.0 накопичувачів:\n" +
            "Завдяки вбудованим M.2-роз'ємів NVMe PCIe 4.0 / 3.0 x4 і PCIe 3.0 x2 материнські плати Gigabyte надають користувачам можливість під'єднати до системи твердотілі NVMe PCIe або SATA-накопичувачі (максимальна пропускна здатність до 64 Гбіт/с). Залучивши обидва роз'єми M.2, можна організувати ідеальне високошвидкісне сховище даних, зокрема й засобами доступного RAID-масиву.\n" +
            "\n" +
            "Ексклюзивний ігровий контролер Realtek RTL8118AS:\n" +
            "Високошвидкісний канал Gigabit LAN і автоматичний розподіл трафіку\n" +
            "Мікросхема Realtek RTL8118 GbE LAN — це високопродуктивний мережевий контролер для ігрових ПК, наділений можливістю автоматично розподіляти ресурси смуги пропускання мережевого інтерфейсу, для забезпечення найвищого пріоритету для призначеного застосунку, зокрема й ігрового. Контролер має всі популярні функції, завдяки яким робота в інтернеті стає продуктивною й безпечною.\n" +
            "\n" +
            "Роз'єм HDMI 2.1 для 4K/60P/21:9/захист контенту HDCP 2.3:\n" +
            "HDMI 2.1 — це мультимедійний інтерфейс високої чіткості, обернено сумісний із версіями HDMI 2.0/1.4, який забезпечує одночасне передання засобами одного кабелю відеосигналу зі швидкістю до 48 Гбіт/с (вдвічі швидше інтерфейсу попереднього покоління). Засобами інтерфейсу можна одночасно передавати кілька відеопотоків в оригінальному для кінематографа форматі 21:9 (в зазначеному співвідношенні сторін знімається більшість фільмів), підтримуються технології Full HDR і HDCP 2.3 і забезпечується найкраще візуальне сприйняття медіаконтенту.\n" +
            "\n" +
            "Індустріальний стандарт для захисту LAN-портів від статичної електрики та пробою:\n" +
            "Для захисту від електростатики в материнських платах Gigabyte застосовуються мікросхеми, запас міцності яких у тричі вищий за типові ІС. Це допомагає надійно захистити материнську плату та її компоненти від пошкоджень, викликаних статичною електрикою. Материнські плати Gigabyte також обладнані спеціальними мікросхемами, які забезпечують захист материнської плати й ПК загалом від перенапруг і перевищення потужності в разі перебоїв з електроживленням." +
            "Smart Fan 5\n" +
            "Завдяки Smart Fan 5 користувачі можуть бути впевнені в тому, що їхній ігровий ПК буде функціонувати в найбільш сприятливому температурному режимі без шкоди для продуктивності. Завдяки термодатчикам, що розміщені на материнській платі, засобами Smart Fan 5 можна контролювати роботу кожного вентилятора. Окрім того, Smart Fan 5 — це ще й більша кількість гібридних роз'ємів для під'єднання вентиляторів, які підтримують режими роботи PWM і Voltage, забезпечуючи максимальну зручність обслуговування встановленої рідинної системи охолодження.\n" +
            "\n" +
            "Fan Stop:\n" +
            "Прихильникам тиші! Завдяки функції Fan Stop вентилятор повністю зупиниться того моменту, коли температура виявиться нижче зазначеного порогового значення. Який саме вентилятор має зупинитися на підставі показань обраного датчика та за якої саме температури, — все це користувач зможе налаштувати, зважаючи на власні вподобання.\n" +
            "\n" +
            "Застосунок RGB Fusion 2.0:\n" +
            "Функціональні можливості програми RGB Fusion 2.0 на материнських платах Gigabyte B550-серії, стосовно адресовних світлодіодних лінійок, розкриваються в повному обсязі. З допомогою фірмового застосунку RGB Fusion 2.0 можна вибирати режими й керувати підсвіткою ПК, реалізованою засобами вбудованих RGB- і зовнішніх адресованих світлодіодних RGB-лінійок. Можливість вибору кольорової гами та активації готових шаблонів у RGB Fusion 2.0 була наявна й раніше, тепер істотно перероблена опція керування лінійками з адресованими світлодіодами. Для кожного світлодіода такої лінійки можна залучити цифрову адресацію, що дає змогу дістати внаслідок цього унікальну кольорову палітру світіння, формувати стилі та нові оригінальні варіанти підсвітки.\n" +
            "\n" +
            "Материнські плати Gigabyte B550-серії готові до роботи із зовнішніми адресованими світлодіодними лінійками з напругою живлення до 5 В (до 300 світлодіодів у лінійці). Для організації підсвічування засобами адресованих світлодіодних лінійок з допомогою програми RGB Fusion 2.0 можна залучити нові шаблони та варіювати численні параметри вибраного режиму світіння.\n" +
            "\n" +
            "RGB Fusion 2.0\n" +
            "Інтуїтивно зрозумілий інтерфейс і розширений функціонал застосунку RGB Fusion 2.0 дають нагоду швидко та максимально ефективно налаштувати підсвітку будь-якого сумісного з цією технологією пристрою. Об'єднуйте в одну схему підсвічування материнську плату та графічний 3D-прискорювач, периферійні пристрої та інші компоненти, надайте вашому ігровому ПК унікального неповторного вигляду й поділіться персональними профілями з друзями. Новий режим підсвітки <Гра> дає змогу застосувати доступні світлові ефекти до обраних ігрових застосунків, допомагаючи зробити розваги на ПК ще інтерактивнішими та придбати неоціненний ігровий досвід.\n" +
            "\n" +
            "High-End аудіоконденсатори:\n" +
            "На материнських платах Gigabyte встановлюються аудіоконденсатори high-end класу. Такі компоненти дають нагоду із високою правильністю відтворювати генерований сигнал, забезпечуючи чудове звучання й реалістичні спецефекти в іграх.\n" +
            "\n" +
            "Антишумовий екран:\n" +
            "Материнські плати Gigabyte обладнані антишумовим екраном звукової підсистеми, який мінімізує вплив перешкод і наведень на чутливі аналогові компоненти аудіотракта на рівні схемотехніки друкованої плати.\n" +
            "\n" +
            "Кнопка Q-Flash Plus:\n" +
            "Оновлений мікрокод BIOS без ЦП, модулів ОЗП і дискретної графіки\n" +
            "Завдяки фірмовій технології Gigabyte Q-Flash Plus для поновлення мікрокода BIOS вам навіть не потрібно встановлювати в систему процесор, пам'ять, графічну плату та викликати меню BIOS Setup. Просто завантажте із сервера Gigabyte і збережіть на USB флешнакопичувачі актуальну версію BIOS (змініть ім'я збереженого файлу на Gigabyte.bin), а потім натисніть спеціальну кнопку Q-Flash Plus. Трохи терпіння, – й усе готово!\n" +
            "\n" +
            "Суцільнометалеві контакти:\n" +
            "Материнські плати Gigabyte B550-серії обладнані ATX 12 В роз'ємами живлення процесора із суцільнометалевими контактами для забезпечення безперебійної роботи ЦП, зокрема й в умовах підвищеного навантаження.\n" +
            "\n" +
            "Захист від оксидів сірки:\n" +
            "З'єднання сірки в повітрі можуть впливати на планарні компоненти (зокрема, резистори), створюючи хімічні сполуки, що можуть викликати коротке замикання. Якщо це станеться, материнська плата не зможе функціонувати. Встановлюючи резистори, стійкі до впливу оксидів сірки, компанія Gigabyte пропонує якісно новий рівень захисту Ultra Durable своїх виробів.","/images/mama3.jpg"));
    products.add(new Product(27L,"Термопаста ARCTIC MX-7 8 г","Other",7,"\n" +
            "Високопродуктивна термопаста для стабільного охолодження:\n" +
            "\n"+
            "ARCTIC MX-7 ULTIMATE — це сучасна термопаста, створена для ефективного тепловідведення у продуктивних комп’ютерних системах. Вона орієнтована на користувачів, які очікують стабільної роботи процесорів і графічних чипів під тривалим навантаженням, зокрема в ігрових, робочих і професійних конфігураціях. Завдяки оптимізованому складу термопаста формує надійний тепловий контакт між кристалом і системою охолодження.\n" +
            "\n" +
            "Збалансована консистенція та зручне нанесення:\n" +
            "\n"+
            "В’язкість у діапазоні 35 000–38 000 poise забезпечує контрольоване нанесення без розтікання та надмірного тиску. MX-7 рівномірно заповнює мікронерівності поверхонь, створюючи щільний і стабільний теплопровідний шар. Щільність 2,9 г/см³ сприяє збереженню структури пасти протягом усього строку експлуатації без висихання.\n" +
            "\n" +
            "Стабільна робота в екстремальних умовах:\n" +
            "\n"+
            "ARCTIC MX-7 ULTIMATE зберігає свої властивості в широкому температурному діапазоні від −50 до 250 °C. Це дає змогу використовувати її як у повсякденних системах, так і в умовах високого теплового навантаження або розгону, де стабільність термоінтерфейсу має вирішальне значення.\n" +
            "\n" +
            "Електрична безпека компонентів:\n" +
            "\n"+
            "Високий питомий опір на рівні 1,7 × 10¹² Ом·см і пробивна напруга 4,2 кВ/мм забезпечують електричну ізоляцію. Це знижує ризик коротких замикань при випадковому контакті термопасти з елементами навколо сокета або чипа, що особливо важливо для сучасних щільно компонованих плат.\n" +
            "\n" +
            "Універсальне застосування:\n" +
            "\n"+
            "MX-7 ULTIMATE підходить для процесорів, графічних адаптерів, чипсетів та інших компонентів, де потрібен надійний тепловий контакт. Вона сумісна з повітряними та рідинними системами охолодження, залишаючись практичним вибором для складання та обслуговування сучасних ПК.","/images/pasta2.jpg"));
    products.add(new Product(28L,"Intel Core i5-12400F","CPU",158,"Intel Core i5-12400F – процесор для настільних ПК з 6 ядрами, випущений у січні 2022 року. Він входить у лінійку Core i5, використовує архітектуру Alder Lake-S із роз'ємом Socket 1700. Завдяки технології Intel Hyper-Threading кількість ядер фактично подвоєна – до 12 потоків. Core i5-12400F має 18 МБ кешу L3 і працює на частоті 2,5 ГГц за замовчуванням, але може розганятися до 4,4 ГГц залежно від робочого навантаження. Intel виробляє Core i5-12400F на виробничому вузлі 10 нм, кількість транзисторів невідома. Чисельник у Core i5-12400F заблокований, що обмежує його розгінний потенціал.\n" +
            "\n" +
            "Підтримка DDR4/DDR5 та PCI-E 5.0:\n" +
            "При TDP 65 Вт Core i5-12400F споживає своєрідне для сучасного ПК енергоспоживання. Процесор Intel підтримує пам'ять DDR4 та DDR5 з двоканальним інтерфейсом. Для зв'язку з іншими компонентами комп'ютера Core i5-12400F використовує з'єднання PCI-Express Gen 5. Цей процесор не має інтегрованої графіки, вам потрібна окрема відеокарта.\n" +
            "\n" +
            "Технології віртуалізації:\n" +
            "На Core i5-12400F є апаратна віртуалізація, яка значно підвищує продуктивність віртуальних машин. Крім того, підтримується віртуалізація IOMMU (PCI passthrough), завдяки чому гостьові віртуальні машини можуть безпосередньо використовувати апаратне забезпечення хоста. Програми, що використовують розширені векторні розширення (AVX), можуть працювати на цьому процесорі, що підвищує продуктивність програм, що вимагають великих обчислень. Крім AVX, Intel також включає новіший стандарт AVX2, але не AVX-512.","/images/cpu4.jpg"));
    products.add(new Product(29L,"Килимок для миші Holmer 600х300х3 мм Black","Periphery",3,"Holmer OMP-04 — це універсальний настільний килимок (Desk Mat), який пропонує величезний простір для організації вашого робочого місця. Завдяки розміру 600 х 300 мм, він легко вміщує і клавіатуру, і мишу, забезпечуючи єдність стилю, комфорт та стабільність для обох пристроїв.","/images/kov1.jpg"));
    products.add(new Product(30L,"Миша HATOR Hellyberry HM47 Wireless Black-Violet","Periphery",30,"Миша HATOR Hellyberry Wireless — швидкість, точність та абсолютна свобода\n" +
            "\n" +
            "HATOR Hellyberry (HM47) — це ультралегка ігрова миша, створена для блискавичних реакцій та точного контролю. Вона поєднує в собі мінімальну вагу, ергономічну симетричну форму та сучасні бездротові технології. Це ідеальне рішення для геймерів, які цінують комфорт, мобільність та лаконічний дизайн.\n" +
            "\n" +
            "Ультралегка конструкція: Завдяки надзвичайно малій вазі — всього 47 грамів — миша забезпечує легкість рухів без зайвого навантаження на кисть навіть під час тривалих ігрових сесій.\n" +
            "\n" +
            "Ергономіка та витривалість: Симетрична форма ідеально підходить для різних типів хвату, забезпечуючи стабільний контроль. Корпус із преміальним UV-покриттям приємний на дотик, стійкий до зносу та зберігає охайний вигляд при інтенсивному використанні.\n" +
            "\n" +
            "Три режими підключення: Миша адаптується під будь-який сценарій: швидке бездротове з’єднання 2.4 ГГц для геймінгу, Bluetooth для роботи та мобільних пристроїв, а також дротовий режим USB для безперервної гри.\n" +
            "\n" +
            "Магнітна зарядна док-станція: Заряджання стає максимально зручним — достатньо просто встановити мишу на станцію. Вбудоване RGB-підсвічування док-станції додає стильного акценту ігровому простору.","/images/mous1.jpg"));
    products.add(new Product(31L,"ASUS DUAL-GTX1060-O3G","GPU",119,"ASUS Dual GeForce GTX 1060 OC (3GB)\n" +
            "Надійне рішення для Full HD геймінгу, навчання та роботи. Карта поєднує заводський розгін, ефективне охолодження та високу якість збірки від ASUS.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Продуктивність: Заводський розгін до 1809 МГц та 192-бітна шина забезпечують стабільний FPS у популярних іграх (CS2 ~170 FPS, Valorant ~240 FPS, GTA V ~95 FPS).\n" +
            "\n" +
            "Охолодження та надійність: Система з двома вентиляторами має пилозахист IP5X. Карта виготовлена за повністю автоматизованою технологією Auto-Extreme.\n" +
            "\n" +
            "Енергоефективність: Споживає всього 120 Вт, потребує одного роз'єму живлення 6-pin та БЖ від 400 Вт.\n" +
            "\n" +
            "Гнучкість підключень: 5 відеовиходів (2×HDMI, 2×DP, 1×DVI) дозволяють зручно підключати монітори, VR-шоломи або телевізори.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Пам'ять: 3 ГБ GDDR5 (192-біт).\n" +
            "\n" +
            "Інтерфейс: PCI Express 3.0.\n" +
            "\n" +
            "Підтримка технологій: DirectX 12, NVIDIA G-SYNC, Ansel, GPU Boost 3.0.\n" +
            "\n" +
            "Габарити: 242 мм (2 слоти), підійде для більшості корпусів", "/images/video6.jpg"));
    products.add(new Product(32L,"Веб-камера 4K UGREEN 8 МП із двома мікрофонами","Periphery",52,"\n" +
            "Вебкамера UGREEN 4K FHD 8 МП  — професійне рішення для відеоконференцій, стрімінгу та онлайн-спілкування з неперевершеною якістю зображення та звуку.\n" +
            "\n" +
            "Завдяки роздільній здатності 4K Ultra HD (3840×2160) при 30 кадрах/сек та сенсору на 8 мегапікселів, ви отримаєте надзвичайно чітке, деталізоване та насичене зображення. А для плавного та природного відео доступна підтримка Full HD 1080p при 60 кадрах/сек — ідеально для YouTube, Twitch та відеоблогів.\n" +
            "\n" +
            "Переваги моделі:\n" +
            "\n" +
            "4K Ultra HD — максимальна чіткість і деталізація.\n" +
            "Подвійні всеспрямовані мікрофони з шумозаглушенням для чистого стереозвуку.\n" +
            "Автоматична корекція освітлення (DRC) та автофокус для чіткого зображення в будь-яких умовах.\n" +
            "Регульований кут огляду 360° і вертикальний нахил на 15°.\n" +
            "Plug-and-Play — підключення без встановлення драйверів.\n" +
            "Захисна шторка для конфіденційності.\n" +
            "Сумісність з Windows, macOS, Linux, Android.\n" +
            "Технічні характеристики:\n" +
            "\n" +
            "Бренд: UGREEN\n" +
            "Матриця: 8 Мп\n" +
            "Максимальна роздільна здатність: 4K (3840×2160), 30 fps\n" +
            "Додатковий режим: Full HD 1080p, 60 fps\n" +
            "Кути огляду: 70° діагональ, 62° горизонталь, 37,5° вертикаль\n" +
            "Автофокус: так\n" +
            "Матеріали: ABS + алюмінієвий сплав\n" +
            "Довжина кабелю: 2 м\n" +
            "Колір: чорний\n" +
            "UGREEN 4K — вибір для тих, хто хоче виглядати та звучати професійно на кожній зустрічі, трансляції чи онлайн-уроці.","/images/camera1.jpg"));
    products.add(new Product(33L, "GameMax RGB-1300 (1300 Вт) 140мм","PSU",143,"Блок живлення 1300W (High-Power Edition)\n" +
            "Потужне та надійне рішення для геймерських систем та професійних робочих станцій. Завдяки високій потужності у 1300 Вт та підтримці сучасних стандартів, цей БП легко впорається з найбільш енерговибагливими компонентами.\n" +
            "\n" +
            "Основні переваги:\n" +
            "Висока потужність: Лінія +12 В видає вражаючі 108 А, що гарантує стабільну роботу потужних відеокарт та процесорів.\n" +
            "\n" +
            "Готовність до нових відеокарт: Оснащений роз'ємом PCI-E 5.0 (650 мм) та має загалом 5 роз'ємів для додаткового живлення графічних адаптерів.\n" +
            "\n" +
            "Комплексний захист: Повний пакет систем безпеки, включаючи захист від короткого замикання (SCP), перевантаження (OPP/OCP), перегріву (OTP) та перепадів напруги (OVP/UVP).\n" +
            "\n" +
            "Масштабованість: Велика кількість інтерфейсів для периферії — 10 роз'ємів SATA для накопичувачів.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Габарити: 170 x 150 x 86 мм (вага 1.57 кг).\n" +
            "\n" +
            "Струм: +3.3 В та +5 В — по 20 А.\n" +
            "\n" +
            "Довжина кабелів: Живлення відеокарт — від 550 до 650 мм.\n" +
            "\n" +
            "Для кого: Ідеальний вибір для збірок з декількома відеокартами або топовими картами серії RTX 40-ї та 50-ї лінійок, де потрібен стабільний запас потужності.","/images/block4.jpg"));
    products.add(new Product(34L,"ID-Cooling SE-224-XTS ARGB Black","Cooling", 25,"\n" +
            "Нова система охолодженняID-Cooling побудована на чотирьох мідних теплових трубках діаметром 6 мм. Трубки зібрані в алюмінієвій основі та зможуть безпосередньо контактувати з кришкою процесора. На трубках розташувався невеликий алюмінієвий радіатор шириною 75 мм.\n" +
            "\n" +
            "Як неважко здогадатися з назви, під брендом ID-Cooling виробляються системи охолодження. Вона створює найрізноманітніші рішення - від простих повітряних кулерів для центральних процесорів недорогих офісних систем до складних систем рідинного охолодження, які охоче купують геймери і комп'ютерні ентузіасти.\n" +
            "\n" +
            "Також ID-Cooling є сертифікованим постачальником для провідних компаній, які займаються виробництвом різноманітної обчислювальної техніки. Бренд було створено китайською компанією Shenzhen Wan Jing Hua Technology Co., Ltd. Деякий час вона займалася OEM-складанням системи охолодження, потім вирішено було спробувати налагодити випуск продукції під власною торговою маркою.\n" +
            "\n" +
            "Найперші напрацювання ID-Cooling були представлені відносно недавно — 2003 року. Це були процесорні кулери, які зуміли швидко привернути увагу користувачів завдяки високій ефективності при привабливій вартості. За роки існування компанія представила чимало цікавих рішень, їй належить створення деяких унікальних розробок.\n" +
            "\n" +
            "З недавніх пір компанія почала займатися також і виробництвом різноманітних освітлювальних систем.","/images/cool4.jpg"));
    products.add(new Product(35L,"Kingston Fury SODIMM DDR5-5600 65536MB PC5-44800 (Kit of 2x32768) Impact 2Rx8 Black (KF556S40IBK2-64)","RAM",682,"\n" +
            "З чудовою швидкістю, функцією Plug N Play, подвоєною з 16 до 32 кількістю банків і подвоєною з 8 до 16 довжиною пакета Kingston FURY Impact DDR5 ідеально підходить для геймерів і ентузіастів, яким потрібна вища продуктивність на платформах наступного покоління.\n" +
            "\n" +
            "Збільшуючи швидкість, місткість і надійність, Kingston FURY Impact DDR5 пропонує цілий арсенал розширених функцій, як-от ECC на кристалі (ODECC) для підвищення стабільності на екстремальних швидкостях, два 32-бітові підканали для підвищення ефективності та інтегрована в модуль схема керування живленням (PMIC), яка забезпечує контроль і підстроювання напруг безпосередньо на модулі пам'яті. Під час гри в найекстремальніших умовах, під час стрімінгу у форматі 4K і вище або під час серйозної анімації та 3D-рендерінгу, Kingston FURY Impact DDR5 - це наступне підвищення рівня, під час якого ідеально поєднуються стиль і продуктивність. \n" +
            "\n" +
            "Крім того, Kingston FURY Impact DDR5 отримала сертифікат Intel XMP 3.0 і Certified, що означає, що користувачі можуть розраховувати на простий, стабільний і сертифікований розгін. \n" +
            "\n" +
            "Особливості:\n" +
            "Вища продуктивність: Пам'ять DDR5 на 50% швидша, ніж DDR4, що додає продуктивності в іграх, рендері та багатозадачних середовищах.\n" +
            "Підтримка технології автоматичного розгону Plug N Play Automatic Overclocking: Kingston FURY Impact DDR5 підтримує автоматичний розгін до максимальної частоти, зазначеної в специфікаціях.\n" +
            "Сертифікація Intel XMP 3.0: Підвищення продуктивності пам'яті з попередньо оптимізованими таймінгами, швидкістю і напругою живлення для розгону. \n" +
            "Нижче енергоспоживання, вища ефективність: Зниження тепловиділення і підвищення ефективності системи завдяки низькій напрузі живлення пам'яті Impact DDR5 1.1 В.\n" +
            "Підвищена стабільність під час розгону: Корекція помилок на кристалі (On-die ECC, ODECC) допомагає забезпечити цілісність даних під час розгону пам'яті для підвищення її продуктивності.","/images/ope4.jpg"));
    products.add(new Product(36L,"PcCooler R400 ARGB BK","Cooling",17,"\n" +
            "Кулер R400 ARGB BK — це оновлена класика від PcCOOLER. Уніфікований трикутний візерунок оживив майже аскетичний дизайн. Теплові трубки працюють у будь-якому напрямку, горизонтально або вертикально, без впливу сили тяжіння. Потужний, але тихий HB PWM вентилятор високої якості з чітким математичним балансом між потоком повітря до 40.94 фут3/хв і тиском до 2.16 мм H2O дозволяє досягти 180 Вт потужності. Виробник потішив виглядом верхньої кришки з підсвіткою ARGB, яка стала візитівкою цієї моделі. Професійний підхід відчувається і до процесу встановлення кулера — відсунутий назад радіатор дозволяє встановити оперативну пам’ять без демонтажу вентилятора. Кулер висотою 133 мм має абсолютну сумісність для складання низькопрофільних ПК. Техніка високоякісного штампування ребер дозволила суттєво зміцнити пластини радіатора та зосередити напрямок потоку повітря. Безпосередній контакт мідних теплових трубок із процесором забезпечує відмінну теплопровідність для максимальної ефективності охолодження.\n" +
            "Компактний розмір потужного охолодження для будь-якого корпуса\n" +
            "Теплові трубки зі зворотною гравітацією 4х6 мм\n" +
            "Новий дизайн \"TRIFORCE\"\n" +
            "PWM HB 92 мм 5В ARGB вентилятор\n" +
            "Верхня кришка з ARGB підсвіткою\n" +
            "Легке встановлення\n" +
            "Посилені ребра радіатора\n" +
            "HDT 3.0 основа","/images/cool5.jpg"));
    products.add(new Product(37L,"Intel Core Ultra 7 265KF 3.9GHz/30MB (BX80768265KF) s1851 BOX","CPU",356,"\n" +
            "Процесор Intel Core Ultra 7 для настільних ПК 265KF, без процесорної графіки. Завдяки підтримці PCIe 5.0 і 4.0 та DDR5 розблоковані процесори Intel Core Ultra 7 для настільних ПК (серія 2) оптимізовані для геймерів і продуктивності та забезпечують високу продуктивність. Потрібна дискретна графіка. Сумісність із материнськими платами на базі набору мікросхем Intel 800 Series. Базова потужність процесора 125 Вт.","/images/cpu5.jpg"));
    products.add(new Product(38L,"Gigabyte PCI-Ex GeForce RTX 2070 Super Gaming OC 3X 8GB GDDR6 (256bit)(HDMI, 3 x DisplayPort)","GPU",273,"\n" +
            "Нова флагманська відеокарта nVidia – це революційний рівень продуктивності і реалізму в іграх. Потужна архітектура NVIDIA Тьюринга, інноваційні технології і 8 ГБ ультраскоростной пам'яті нового покоління GDDR6 роблять її кращою в світі ігровою відеокартою.\n" +
            "\n" +
            "nVidia Тьюринга\n" +
            "Відеокарти серії GeForce 20 створені на базі потужної архітектури Тьюринга і абсолютно нової платформи RTX Super. Вони до 6 разів продуктивніше відеокарт попереднього покоління і привносять в ігри технології штучного інтелекту і трасування променів в реальному часі.\n" +
            "\n" +
            "Axial-tech\n" +
            "Вентилятори Axial-tech були розроблені для нових відеокарт останнього покоління ROG і оснащені меншим концентратором для більш довгих лопатей, бар'єрним кільцем для підвищення тиску повітря вниз і пылеустойчивостью IP5X для збільшення терміну служби.\n" +
            "\n" +
            "Якість і надійність. Технологія Auto-Extreme.\n" +
            "Стабільній роботі відеокарт сприяє високоякісна елементна база і ексклюзивна технологія Auto-Extreme, яка передбачає перший в індустрії на 100% автоматизований процес виробництва.\n" +
            "\n" +
            "Для геймерів\n" +
            "Відеокарта серії GeForce RTX Super 20 – це виняткова продуктивність і підтримка сучасних геймерських технологій.\n" +
            "\n" +
            "NVIDIA G-SYNC\n" +
            "Ця революційна технологія забезпечує найбільш швидкий і плавний ігровий процес в історії. G-SYNC синхронізує швидкість регенерації зображення дисплея з відеокартою GeForce RTX. Це усуває розриви, і мінімізує тремтіння і затримки зображення.\n" +
            "\n" +
            "NVIDIA SLI\n" +
            "\n" +
            "Технологія NVIDIA SLI – це революційна платформа, що дозволяє гнучко змінювати графічну продуктивність шляхом об'єднання декількох графічних рішень NVIDIA в одній системі на базі SLI-сертифікованої материнської плати.","/images/video7.jpg"));
    products.add(new Product(39L,"Asus PRIME B760-PLUS D4 (s1700, Intel B760, PCI-Ex16)","Mother",135,"\n" +
            "Материнська плата ASUS серії Prime створена спеціально для того, щоб розкрити весь потенціал процесорів Intel Core 13-го покоління. Маючи надійну конструкцію живлення, комплексні рішення для охолодження та інтелектуальні можливості налаштування, PRIME B760M-PLUS D4 надає користувачам і збирачам ПК ряд оптимізацій продуктивності за допомогою інтуїтивно зрозумілих програмних і вбудованих функцій.\n" +
            "\n" +
            "Гнучкість\n" +
            "Комплексні елементи керування становлять основу серії ASUS PRIME. Материнська плата PRIME B760 включає гнучкі інструменти для налаштування кожного аспекту вашої системи, дозволяючи налаштовувати продуктивність відповідно до вашого стилю роботи та максимізувати продуктивність.\n" +
            "\n" +
            "Інтелектуальне управління\n" +
            "ASUS Intelligent Control робить ваш комп'ютер розумним. Поряд із комплексним налаштуванням та динамічною оптимізацією основних аспектів вашої системи, він пропонує розумно спрощені варіанти для новачків у самостійній роботі з ПК, а також повніші функції для досвідчених ветеранів.\n" +
            "\n" +
            "Охолодження\n" +
            "Серія PRIME B760 оснащена кількома вбудованими радіаторами та набором гібридних роз'ємів для вентиляторів, щоб ваша установка залишалася прохолодною та стабільною при інтенсивних робочих навантаженнях.\n" +
            "\n" +
            "M.2 Радіатор\n" +
            "Радіатор M.2 запобігає дроселюванню, яке може статися зі сховищем M.2 під час стійких передач. Радіатор утримується на місці невипадаючими гвинтами, і ці знімні гвинти, що не випадають, допомагають знизити ризик падіння або втрати під час вилучення радіатора.\n" +
            "\n" +
            "Продуктивність\n" +
            "Серія PRIME B760 призначена для обробки великого кількості ядер та вимог до пропускної спроможності процесорів Intel Core 13-го покоління. Материнська плата ASUS B760 забезпечує все необхідне для підвищення щоденної продуктивності, тому ваша система буде готова до роботи завдяки стабільному живленню, інтуїтивно зрозумілому охолодженню та гнучким можливостям передачі даних.","/images/mama4.jpg"));
    products.add(new Product(40L,"MSI B850 Gaming Plus Wi-Fi (sAM5, AMD B850, PCI-Ex16)","Mother",205,"Неперевершена продуктивність\n" +
            "З огляду на стрімкі технологічні зміни, MSI завжди слідує останнім тенденціям і надає клієнтам передові функції та новітні технології. Материнські плати MSI оснащені модернізованим рішенням щодо живлення, новітніми стандартами зберігання даних та відмінними можливостями підключення, що забезпечує оптимальну продуктивність для ігор.\n" +
            "\n" +
            "Видатний тепловий дизайн\n" +
            "Неперевершена продуктивність материнських плат MSI гарантується інноваційним та оптимізованим тепловим дизайном, що забезпечує найкращу стабільність процесора, набору мікросхем, твердотілових накопичувачів та низькі температури при повному навантаженні додатків та ігровій продуктивності.\n" +
            "\n" +
            "Підключення\n" +
            "Материнські плати MSI забезпечують неперевершені можливості підключення завдяки блискавичній швидкості передачі даних через мережу нового покоління, сховище та підключення Wi-Fi.\n" +
            "\n" +
            "Персоналізація\n" +
            "Материнські плати MSI поставляються в комплекті з декількома корисними та інтуїтивно зрозумілими програмами, що допомагають користувачам контролювати кожен аспект материнської плати і забезпечують світловий ефект, що налаштовується, з видатною естетикою, щоб відповідати вашій унікальній індивідуальності.","/images/mama5.jpg"));
    products.add(new Product(41L,"Asus ROG Strix B850-A Gaming Wi-Fi (sAM5, AMD B850, PCI-Ex16)","Mother",250,"ASUS ROG Strix B850-A Gaming WiFi\n" +
            "Преміальна материнська плата в білому дизайні, створена для максимальної продуктивності процесорів AMD Ryzen 9000/8000/7000. Це ідеальний фундамент для сучасної ігрової збірки з підтримкою технологій ШІ та надшвидкісних інтерфейсів.\n" +
            "\n" +
            "Основні переваги:\n" +
            "Новітні стандарти: Повна підтримка PCIe 5.0 для відеокарт і накопичувачів, а також пам'яті DDR5 (до 192 ГБ, частота до 8000 МГц).\n" +
            "\n" +
            "Бездротовий зв'язок майбутнього: Вбудований модуль Wi-Fi 7 та Bluetooth для блискавичного передавання даних.\n" +
            "\n" +
            "Потужне підключення: Порт USB-C 20 Гбіт/с, 2.5Gb Ethernet та 4 роз'єми M.2 для швидкісних SSD.\n" +
            "\n" +
            "Естетика та звук: Біла друкована плата з вбудованим підсвічуванням та аудіосистема ROG SupremeFX (ALC4080) для кришталевого звуку.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Сокет/Чипсет: AM5 / AMD B850.\n" +
            "\n" +
            "Формфактор: ATX (305 x 244 мм).\n" +
            "\n" +
            "Слоти: 1 x PCIe 5.0 x16, 4 слоти DDR5.\n" +
            "\n" +
            "Порти: HDMI, DisplayPort, Optical S/PDIF, кнопки BIOS FlashBack та Clear CMOS.\n" +
            "\n" +
            "Живлення: Посилена схема (24-pin + два 8-pin).\n" +
            "\n" +
            "Резюме: ROG Strix B850-A — це поєднання футуристичного білого стилю та передових технологій (PCIe 5.0, Wi-Fi 7), що робить її ідеальним вибором для потужного ПК 2026 року.","/images/mama6.jpg"));
    products.add(new Product(42L,"Gigabyte B650 Gaming X AX V2 (sAM5, AMD B650, PCI-Ex16)","Mother",172,"\n" +
            "Неперевершена продуктивність\n" +
            "З огляду на стрімкі технологічні зміни, GIGABYTE завжди слідує останнім тенденціям і надає клієнтам передові функції та новітні технології. Материнські плати GIGABYTE оснащені модернізованим рішенням щодо живлення, новітніми стандартами зберігання даних та відмінними можливостями підключення, що забезпечує оптимальну продуктивність для ігор.\n" +
            "\n" +
            "Підключення\n" +
            "Материнські плати GIGABYTE забезпечують неперевершену якість підключення завдяки блискавичній швидкості передачі даних через мережу наступного покоління, сховище та підключення до WIFI.\n" +
            " \n" +
            "Персоналізація\n" +
            "Материнські плати GIGABYTE поставляються в комплекті з декількома корисними та інтуїтивно зрозумілими програмами, що допомагають користувачам контролювати кожен аспект материнської плати та забезпечують світловий ефект, що налаштовується, з видатною естетикою, щоб відповідати вашій унікальній індивідуальності.\n" +
            "\n" +
            "Ультраміцний\n" +
            "Конструкція GIGABYTE Ultra Durable забезпечує довговічність продукту та високу якість виробничого процесу. Материнські плати GIGABYTE використовують найкращі компоненти та підсилюють кожен слот, щоб зробити кожен з них міцним та довговічним.","/images/mama7.jpg"));
    products.add(new Product(43L,"be quiet! POWER ZONE 2 850W (BP007EU)","PSU",175,"\n" +
            "Виняткова ефективність для геймерів\n" +
            "Power Zone 2 850W — це блок живлення з сертифікатом 80 PLUS Platinum і напівпасивним режимом \"zero-RPM\" для ефективного і безшумного охолодження.\n" +
            "Ефективність 80 PLUS Platinum та Cybenetics Platinum (до 94.1%)\n" +
            "Напівпасивний режим охолодження \"zero-RPM\"\n" +
            "Пост-вентиляція протягом 2-5 хвилин для уникнення частих повторних запусків\n" +
            "Вентилятор Pure Wings 3 140mm для тихого та ефективного охолодження\n" +
            "Кутовий 90° роз’єм 12V-2x6 та сумісність з PCIe 5.1/ATX 3.1\n" +
            "Точне регулювання та стабільність напруги завдяки технології LLC\n" +
            "Унікальний зовнішній вигляд з пізнаваним сітчастим дизайном\n" +
            "Одна потужна високопродуктивна лінія 12В\n" +
            "10 років гарантії від виробника\n" +
            "Сертифікація Platinum\n" +
            "Дуже висока ефективність\n" +
            "Power Zone 2 850W сертифіковано 80 PLUS Platinum та Cybenetics Platinum, що гарантує ефективність перетворення енергії до 94.1%. Це призводить до нижчого енергоспоживання, меншого нагріву, більш тихої роботи та багатьох інших переваг для вашої high-end системи.\n" +
            "\n" +
            "Напівпасивне охолодження ZERO-RPM\n" +
            "Насолоджуйтеся тишею\n" +
            "Великий вентилятор Pure Wings 3 140mm забезпечує надійне охолодження Power Zone 2 850W. Під час низького навантаження системи вентилятор повністю вимикається допоки компоненти не потребуватимуть охолодження при збільшенні навантаження. При зниженні навантаження вентилятор працює ще протягом 2-5 хвилин, щоб уникнути частих і дратівливих запусків і зупинок. У поєднанні з великим розміром вентилятора для активного охолодження цей блок живлення є надзвичайно тихим за будь-яких сценаріїв навантаження.\n" +
            "\n" +
            "Вентилятор Pure Wings 3\n" +
            "Створений спеціально для Power Zone 2\n" +
            "Ми оптимізували характеристики Pure Wings 3 140mm так, щоб зробити його ідеальним рішенням для Power Zone 2 850W. Вентилятор є надзвичайно надійним і служитиме дуже тривалий час. Завдяки великому діаметру вентилятор ефективно та тихо охолоджує силові компоненти блоку живлення.\n" +
            "\n" +
            "Відповідність стандартам майбутнього\n" +
            "Кутовий 90° роз’єм 12V-2x6 у комплекті поставки\n" +
            "Power Zone 2 850W — це блок живлення стандарту ATX 3.1, що має як сучасний роз’єм 12V-2x6 для відеокарт наступного покоління PCIe 5.1, так і три 6+2-контактні роз’єми PCIe для підтримки GPU поточного покоління. Кутовий 90° роз’єм 12V-2x6 у комплекті не залишає жодних сумнівів у тому, що цей блок живлення з вами надовго. Power Zone 2 850W є насправді універсальним рішенням та ідеальним вибором для поточних ПК та high-end систем майбутнього.\n" +
            "\n" +
            "Новий стандарт потужності\n" +
            "Стабільність при різких стрибках навантаження\n" +
            "Power Zone 2 забезпечує 850 Ват постійної потужності та живлення по одній масивній лінії 12В. Навіть у разі різких короткочасних стрибків енергоспоживання відеокарти, Power Zone 2 850W легко справляється з двократним перевищенням навантаження, що забезпечує надійну і стабільну роботу процесорів і відеокарт наступного покоління.\n" +
            "\n" +
            "Технології високого класу\n" +
            "У приголомшливому дизайні корпуса\n" +
            "Завдяки топології LLC, Power Zone 2 850W пропонує найкраще у своєму класі регулювання напруги та енергоефективність - ідеальний вибір для створення дуже тихих систем або модернізації ігрових ПК чи медіа- систем. Звичайно, технології та високоякісні компоненти є найважливішим для БЖ, але зовнішній вигляд пристрою також має значення. Ось чому Power Zone 2 850W має особливий вигляд із сітчастою фронтальною частиною нового дизайну. Крім того, позначення кабелів надруковані безпосередньо на корпусі блоку живлення для тривалого враження та неперевершеного вигляду та відчуття.","/images/block5.jpg"));
    products.add(new Product(44L,"GameMax GP-450 450W","PSU",38,"\n" +
            "GameMax GP — універсальний і надійний блок живлення, який відповідає сучасним потребам персональних комп'ютерних систем. Він забезпечить високу надійність і ефективність поряд із тихою роботою — найкраща комбінація характеристик, продуктивності та якості у своєму класі за чудовою ціною.\n" +
            "\n" +
            "В елементній базі блоку живлення GameMax застосовано надійні та довговічні конденсатори, а для запобігання виходу блоку живлення з ладу використовується безліч різних технологій захисту.","/images/block6.jpg"));
    products.add(new Product(45L,"ASUS ROG THOR 1200W 80+ Platinum (ROG-THOR-1200P3-GAMING)","PSU",563,"Флагманський блок живлення, що поєднує інноваційні GaN-технології, виняткову стабільність та преміальний дизайн. Створений для найпотужніших збірок, де критично важливі моніторинг та надійність.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Інноваційна база: Використання GaN MOSFET підвищує енергоефективність на 30%, забезпечуючи менше нагрівання при компактних розмірах.\n" +
            "\n" +
            "Стабільність GPU-First: Запатентований стабілізатор напруги покращує живлення відеокарти на 45%, гарантуючи плавність у важких іграх.\n" +
            "\n" +
            "OLED-дисплей на магнітах: Відображає споживання енергії в реальному часі. Магнітне кріплення дозволяє переставити екран залежно від орієнтації БП.\n" +
            "\n" +
            "Стандарт ATX 3.1: Повна сумісність із найсучаснішим обладнанням та підтримка високих пікових навантажень у режимі Turbo.\n" +
            "\n" +
            "Преміальне охолодження: Алюмінієвий корпус, радіатори ROG та вентилятор на подвійних кулькових підшипниках забезпечують тишу та довговічність.\n" +
            "\n" +
            "Технічні особливості:\n" +
            "Ефективність: Сертифікат 80 PLUS Platinum.\n" +
            "\n" +
            "Кабелі: Повністю модульні рифлені кабелі (гнучкі та зручні для кабель-менеджменту).\n" +
            "\n" +
            "Потужність: 1200 Вт — ідеально для RTX 4090/5090 та майбутніх поколінь.","/images/block7.jpg"));
    products.add(new Product(46L,"Корпус DeepCool CC560 V2 Black","Other",67,"\n" +
            "Корпус Mid-Tower DeepCool CC560 V2 пропонує чудове співвідношення ціни та якості завдяки просторій сумісності компонентів, повнорозмірному вікну із загартованого скла та чотирьом встановленим вентиляторам зі світлодіодним підсвічуванням, які забезпечать правильний запуск будь-якої збірки. Моделі V2 розвивають успіх попереднього покоління та підіймають планку.\n" +
            "\n" +
            "Висока продуктивність вентиляції\n" +
            "Добре вентильований по всьому корпусу, CC560 ARGB V2 оснащений передньою панеллю, що забезпечує приплив повітря ззовні, посадковими місцями для вентиляторів на кожусі блоку живлення та великою сітчастою верхньою панеллю для вільної циркуляції свіжого повітря.\n" +
            "\n" +
            "Підготовлений до збирання\n" +
            "Чотири встановлені світлодіодні вентилятори забезпечують високу продуктивність повітряного потоку, гарантуючи першокласне охолодження будь-якої системи.\n" +
            "\n" +
            "Широкі можливості охолодження\n" +
            "Тут достатньо місця для встановлення високопродуктивних рідинних систем охолодження з радіатором 360 мм спереду або 240 мм зверху. Підтримка до восьми вентиляторів розміром 120 мм або до 5 140 мм. На декоративний кожух блоку живлення можна встановити два 120-міліметрові вентилятори для забезпечення додаткового припливу свіжого повітря для вашого вимогливого до потужності графічного процесора!\n" +
            "\n" +
            "Сумісність\n" +
            "Завдяки можливості підтримки материнських плат E-ATX, процесорних кулерів висотою до 165 мм, графічних процесорів завдовжки 370 мм та блоків живлення завдовжки 170 мм, корпус CC560 V2 може бути налаштований з широким спектром високоякісних компонентів.\n" +
            "\n" +
            "Зберігання даних\n" +
            "Підтримка двох 2.5-дюймових твердотілих накопичувачів та двох 3.5-дюймових жорстких дисків. У разі необхідності один із відсіків для жорстких дисків можна використовувати для встановлення третього 2.5-дюймового накопичувача.\n" +
            "\n" +
            "Посилений і зручний\n" +
            "Корпус і бокова скляна панель були модернізовані та посилені для додаткової міцності, а магнітний верхній пиловий фільтр легко очищається. 20-міліметровий простір для прокладання кабелів за лотком материнської плати забезпечує достатній простір для розміщення всіх проводів.\n" +
            "\n" +
            "Верхня панель вводу/виводу\n" +
            "Оснащений легкодоступним портом USB 3.0, портом USB 2.0 та комбінованим аудіороз'ємом.","/images/k1.jpg"));
    products.add(new Product(47L,"Корпус Deepcool CG530 4F Black (R-CG530-BKADA4-G-1)","Other",105,"1stPlayer CG530 Black\n" +
            "Сучасний корпус-вітрина з панорамним оглядом, розроблений для створення візуально бездоганних збірок. Завдяки двокамерній конструкції та відсутності передньої стійки, він забезпечує максимальний фокус на компонентах та ідеальну організацію простору.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Панорамний дизайн: Передня та бічна панелі із загартованого скла без роздільної стійки створюють ефект «акваріума».\n" +
            "\n" +
            "Готовий до роботи: Комплектується 4 ARGB-вентиляторами (3 реверсивні на бічній панелі та 1 стандартний ззаду) з підтримкою PWM-керування.\n" +
            "\n" +
            "Двокамерна структура: Блок живлення та накопичувачі винесені в окремий відсік, що покращує охолодження та спрощує кабель-менеджмент.\n" +
            "\n" +
            "Сумісність із Back-Connect: Підтримує материнські плати з роз'ємами на тильній стороні для максимально чистого вигляду системи.\n" +
            "\n" +
            "Гнучкість охолодження: Підтримка радіаторів СВО до 360 мм на верхній та нижній панелях.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Підтримка плат: ATX, Micro-ATX, ITX.\n" +
            "\n" +
            "Максимальні габарити: Відеокарта до 410 мм, кулер ЦП до 160 мм.\n" +
            "\n" +
            "Інтерфейси (зверху): 1 x USB Type-C, 2 x USB 3.0, аудіороз'єми.\n" +
            "\n" +
            "Накопичувачі: 2 x 3.5\" та до 3 x 2.5\".\n" +
            "\n" +
            "Габарити: 440 x 285 x 399 мм; вага 7 кг.","/images/k2.jpg"));
    products.add(new Product(48L,"Корпус DeepCool Matrexx 55 MESH","Other",55,"DeepCool Matrexx 55 MESH\n" +
            "Високопродуктивний Miditower, розроблений для систем із потужним тепловиділенням. Головна особливість моделі — сітчаста передня панель, яка забезпечує максимально вільний приплив повітря для охолодження компонентів.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Екстремальний обдув: Передня панель у вигляді суцільної металевої сітки гарантує 100% продувність. Система захищена магнітними пиловими фільтрами (зверху, знизу та спереду).\n" +
            "\n" +
            "Чудова сумісність: Підтримує материнські плати формату до E-ATX, масивні відеокарти довжиною до 370 мм та високі процесорні кулери (до 168 мм).\n" +
            "\n" +
            "Преміальний вигляд: Бічна панель із загартованого скла завтовшки 4 мм дозволяє повністю бачити внутрішні компоненти системи.\n" +
            "\n" +
            "Гнучкість СВО: Можливість встановлення радіаторів рідинного охолодження до 360 мм спереду та до 240 мм зверху.\n" +
            "\n" +
            "Зручний монтаж: Простір за піддоном материнської плати (23 мм) спрощує приховане прокладання кабелів.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Форм-фактор: Miditower (440 x 210 x 480 мм).\n" +
            "\n" +
            "Накопичувачі: 2 відсіки 3.5\" та до 4 відсіків 2.5\".\n" +
            "\n" +
            "Охолодження: Підтримка до 6 вентиляторів (3х120/140 мм спереду, 2х120/140 мм зверху, 1х120 мм ззаду).\n" +
            "\n" +
            "Інтерфейси: 1 х USB 3.0, 2 х USB 2.0, аудіороз'єми.","/images/k3.jpg"));
    products.add(new Product(49L,"Корпус 1STPLAYER X4-M-WH-2F1P-W-1F1-W White","Other",35,"1stPlayer X4-M (White)\n" +
            "Компактний та стильний корпус у білому кольорі, що поєднує продуману вентиляцію та сучасний дизайн із загартованим склом. Форм-фактор Minitower робить його ідеальним для збірок на базі плат MicroATX, де важливо зберегти простір без втрати потужності.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Відмінне охолодження: У комплекті вже встановлено 3 RGB-вентилятори (2 х 140 мм спереду та 1 х 120 мм ззаду). Загалом корпус підтримує до 8 вентиляторів.\n" +
            "\n" +
            "Продуманий простір: Попри компактність, корпус вміщує відеокарти довжиною до 330 мм та процесорні кулери висотою до 160 мм.\n" +
            "\n" +
            "Матеріали та дизайн: Бічна панель із загартованого скла дозволяє милуватися компонентами, а нижнє розташування БП та система кабель-менеджменту забезпечують охайний вигляд.\n" +
            "\n" +
            "Підтримка СВО: Можливість встановлення системи водяного охолодження (радіатор до 240 мм) на верхню панель.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Форм-фактор плат: MicroATX, Mini-ITX.\n" +
            "\n" +
            "Інтерфейси: 1 х USB 3.0, 2 х USB 2.0, аудіопорти (розташовані зверху).\n" +
            "\n" +
            "Накопичувачі: 2 відсіки 3.5\" та 2 відсіки 2.5\".\n" +
            "\n" +
            "Габарити: 210 х 423 х 375 мм; вага 4.55 кг.","/images/k4.jpg"));
    products.add(new Product(50L,"Корпус Jonsbo TK-3 White","Other",99,"Jonsbo TK-3 White\n" +
            "Елегантний корпус-акваріум у форматі Mid Tower, головною особливістю якого є панорамна зігнута панель із загартованого скла. Дизайн «без стійок» відкриває бездоганний огляд на внутрішні компоненти, роблячи його ідеальним вибором для виставкових збірок.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Панорамний огляд: Унікальне суцільне скло охоплює передню та бічну панелі, створюючи ефект акваріума.\n" +
            "\n" +
            "Екстремальне охолодження: Підтримка до 10 вентиляторів одночасно та можливість встановлення масивних систем водяного охолодження (до 360 мм зверху та знизу).\n" +
            "\n" +
            "Безмежний простір: Вміщує топові відеокарти довжиною до 420 мм та процесорні кулери висотою до 165 мм.\n" +
            "\n" +
            "Сучасні інтерфейси: Панель введення/виводу оснащена швидкісним портом USB Type-C та двома USB 3.0.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Підтримка плат: ATX, Micro-ATX, Mini-ITX.\n" +
            "\n" +
            "Охолодження: Місця для 120/140 мм вентиляторів на всіх панелях; підтримка СВО 280/360 мм.\n" +
            "\n" +
            "Дискова підсистема: 1 x 3.5\", 2 x 2.5\".\n" +
            "\n" +
            "Матеріали: Сталь, загартоване скло, алюмінієві елементи.\n" +
            "\n" +
            "Габарити: 415 x 288 x 438 мм (вага 7.3 кг).","/images/k5.jpg"));
    products.add(new Product(51L,"Корпус Hyte Y70 Touch Infinite","Other",611,"Hyte Y70 Touch Infinite Black\n" +
            "Культовий корпус-вітрина преміумкласу, що став еталоном для ентузіастів та стрімерів. Головною особливістю моделі є інтегрований у кутову панель сенсорний екран високої роздільної здатності, що дозволяє виводити віджети, моніторинг системи або живі шпалери.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Інтерактивний досвід: Вбудований Touch Infinite дисплей перетворює корпус на повноцінний центр керування та візуалізації стану вашого ПК.\n" +
            "\n" +
            "Панорамна естетика: Трьохсекційне загартоване скло забезпечує безперешкодний огляд комплектуючих під будь-яким кутом.\n" +
            "\n" +
            "Величезний простір: Підтримує найпотужніші повітряні кулери висотою до 180 мм та найдовші сучасні відеокарти.\n" +
            "\n" +
            "Вертикальний акцент: Корпус спроектований для вертикального встановлення відеокарти, що робить її центральним елементом дизайну (райзер входить у комплект або передбачений конструкцією).\n" +
            "\n" +
            "Ефективна вентиляція: Спеціальна перфорація панелей та підтримка масивних радіаторів СВО забезпечують оптимальні температури для топового заліза.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Форм-фактор: Full Tower / Miditower (збільшений об'єм).\n" +
            "\n" +
            "Накопичувачі: 2 відсіки 3.5\" та 3 відсіки 2.5\".\n" +
            "\n" +
            "Слоти розширення: 7 горизонтальних / вертикальних місць.\n" +
            "\n" +
            "Матеріали: Високоякісна сталь та загартоване скло.\n" +
            "\n" +
            "Колір: Глибокий чорний (Infinite Black).","/images/k6.jpg"));
    products.add(new Product(52L,"SSD диск Kingston SSDNow A400 480GB 2.5» SATAIII 3D V-NAND","Other",106,"Kingston A400 480GB (SSD)\n" +
            "Надійний та доступний SSD, який стане ідеальним рішенням для модернізації ноутбука або стаціонарного ПК. Завдяки відсутності рухомих частин і використанню сучасної пам'яті, він працює вдесятеро швидше за класичні жорсткі диски (HDD).\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Висока швидкість: Читання до 500 МБ/с та запис до 450 МБ/с забезпечують миттєвий запуск операційної системи, програм та ігор.\n" +
            "\n" +
            "Надійність та тиша: Побудований на базі флеш-пам'яті 3D V-NAND, накопичувач стійкий до вібрацій, ударів та працює абсолютно безшумно.\n" +
            "\n" +
            "Енергоефективність: Споживає мінімум енергії (макс. 1.5 Вт під час запису), що значно подовжує час роботи ноутбука від акумулятора.\n" +
            "\n" +
            "Універсальність: Стандартний форм-фактор 2.5\" та товщина всього 7 мм дозволяють встановити його практично в будь-який сучасний пристрій.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Об'єм: 480 ГБ.\n" +
            "\n" +
            "Інтерфейс: SATA III (6 Гбіт/с).\n" +
            "\n" +
            "Час напрацювання на відмову: 1 000 000 годин.\n" +
            "\n" +
            "Вага: Лише 41 г.","/images/ssd1.jpg"));
    products.add(new Product(53L,"SSD диск Samsung 870 Evo-Series 1TB 2.5\" SATA III V-NAND 3bit MLC (TLC) (MZ-77E1T0B/EU)","Other",270,"Найпопулярніший у світі SSD накопичувач\n" +
            "\n" +
            "Остання модель найпопулярнішого у світі SSD-накопичувача нарешті з'явилася на ринку. Накопичувач 870 EVO створений на основі технології Samsung, використовуваної у виробництві SSD. Він вирізняється вищою продуктивністю, надійністю та сумісністю, відповідає всім вимогам будь-якого творця контенту, IT-професіоналів і звичайних користувачів.\n" +
            "\n" +
            "Перевага в продуктивності\n" +
            "\n" +
            "Накопичувач 870 EVO з інтерфейсом SATA забезпечує максимальні швидкості послідовного запису/читання близько 560/530 МБ/с. Тепер кожен користувач може скористатися SSD накопичувачем із продуктивністю професійного рівня. Інтелектуальна технологія запису Intelligent TurboWrite зі збільшеним об'ємом змінного буфера дає змогу підвищити швидкість запису та стабільність високих робочих характеристик.\n" +
            "\n" +
            "Надійність промислового рівня\n" +
            "\n" +
            "Накопичувач 870 EVO повністю відповідає промисловим стандартам надійності. Накопичувач розрахований на виконання найрізноманітніших завдань, починаючи від використання в повсякденній роботі до обробки 8K відео. Він оснащений VNAND і MKX контролером 6-го покоління, що забезпечує стабільність його роботи в системах будь-якого призначення.\n" +
            "\n" +
            "Підвищена сумісність\n" +
            "\n" +
            "SSD Накопичувач 870 EVO успішно пройшов тести на сумісність з основними host системами та додатками, включно з чіпсетами, материнськими платами, NAS і пристроями для запису відео. Як новий представник найпопулярніших у світі SSD-накопичувачів серії 870 EVO, що підтвердили свою універсальність, цей накопичувач сумісний із більшістю систем і завдань, які виконує будь-який користувач.\n" +
            "\n" +
            "Простота встановлення під час апгрейду\n" +
            "\n" +
            "Замінити стандартний 2.5-дюймовий SATA накопичувач на вашому ПК або ноутбуці на SSD накопичувач серії 870 EVO простіше простого. Для цього достатньо вставити накопичувач 870 EVO в SATA слот і завантажити міграційне ПЗ, яке зробить за вас все інше.\n" +
            "\n" +
            "ПЗ Samsung Magician\n" +
            "\n" +
            "ПЗ підтримки працездатності вашого SSD. Це нове поліпшене ПЗ Samsung Magacian 6 буде постійно контролювати стан і роботу вашого SSD накопичувача. Ви зможете легко керувати вашим накопичувачем за допомогою різних корисних інструментів, оновлювати прошивку і контролювати стан і працездатність накопичувача і навіть збільшувати його продуктивність.\n" +
            "\n" +
            "Світовий лідер No.1 у виробництві Flash пам'яті\n" +
            "\n" +
            "Оцініть чудові робочі характеристики та надійність SSD накопичувача від провідного світового лідера - виробника систем пам'яті з 2003 року. Усе програмне забезпечення та електронні компоненти, включно зі всесвітньо відомими модулями пам'яті Samsung DRAM і NAND, розроблено та виготовлено на власних підприємствах компанії, що дає змогу їх інтегрувати в системи пам'яті з найвищим рівнем надійності, якому можна довіряти.","/images/ssd2.jpg"));
    products.add(new Product(54L,"Накопичувач HDD Western Digital WD5000 AVDS AV-GP 500GB, 32MB, SATA 300, 3.5","Other",28,"Western Digital AV-GP 500GB (WD5000AVDS)\n" +
            "Надійний внутрішній жорсткий диск серії AV-GP, оптимізований для цілодобової роботи. Ця модель вирізняється зниженим енергоспоживанням, низьким рівнем шуму та високою стабільністю, що робить її чудовим вибором для систем зберігання даних.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Оптимізація для потокового відео: Серія AV-GP розроблена для стабільної роботи в режимі 24/7, ідеально підходить для медіацентрів та систем відеоспостереження.\n" +
            "\n" +
            "Тиха та холодна робота: Завдяки швидкості обертання шпинделя 5400 об/хв, накопичувач мінімально нагрівається та працює практично безшумно.\n" +
            "\n" +
            "Економічність: Технологія Green Power забезпечує низьке енергоспоживання, що подовжує термін служби пристрою та економить ресурси.\n" +
            "\n" +
            "Універсальна сумісність: Легко підключається до систем на базі Windows, Linux та macOS через стандартний інтерфейс SATA.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Об'єм: 500 ГБ.\n" +
            "\n" +
            "Форм-фактор: 3.5\" (стандартний для настільних ПК).\n" +
            "\n" +
            "Буферна пам'ять: 32 МБ.\n" +
            "\n" +
            "Інтерфейс: SATA II (300 МБ/с).","/images/hdd1.jpg"));
    products.add(new Product(55L,"Жорсткий диск Western Digital Purple 2TB 5400rpm 64MB WD23PURZ 3.5 SATA III","Other",191,"Western Digital Purple 2TB (WD23PURZ)\n" +
            "Спеціалізований жорсткий диск, розроблений для систем відеоспостереження (NVR/DVR). Він створений для безперервної роботи в режимі 24/7 і здатний витримувати високі навантаження, характерні для запису відео високої роздільної здатності.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Технологія AllFrame: Спеціальна прошивка мінімізує втрату кадрів та усуває помилки під час відтворення відео, що критично важливо для систем безпеки.\n" +
            "\n" +
            "Висока надійність: Накопичувач стійкий до перепадів температур та вібрацій. Напрацювання на відмову становить 1 000 000 годин.\n" +
            "\n" +
            "Енергоефективність та тиша: Завдяки швидкості 5400 об/хв диск споживає лише 3.8 Вт і працює дуже тихо (до 26 дБ).\n" +
            "\n" +
            "Оптимізація під запис: Підтримує багатопотоковий запис із багатьох камер одночасно без втрати продуктивності.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Об'єм: 2 ТБ.\n" +
            "\n" +
            "Інтерфейс: SATA III (6 Гбіт/с).\n" +
            "\n" +
            "Буфер: 64 МБ.\n" +
            "\n" +
            "Швидкість передачі даних: До 180 МБ/с.\n" +
            "\n" +
            "Форм-фактор: 3.5","/images/hdd2.jpg"));
    products.add(new Product(56L,"Операційна система Windows 11 Для дому на 1ПК (ESD - електронна ліцензія в конверті, всі мови)","Other",182,"Microsoft Windows 11 Home (ESD)\n" +
            "Сучасна операційна система для домашнього використання, що поєднує оновлений інтерфейс, покращену безпеку та високу продуктивність. Це офіційна безстрокова ліцензія у форматі електронного ключа (ESD) для одного пристрою.\n" +
            "\n" +
            "Ключові особливості:\n" +
            "Офіційний продукт: Оригінальна ліцензія від Microsoft (не вторинний ринок), що гарантує отримання всіх актуальних оновлень та патчів безпеки.\n" +
            "\n" +
            "Безстроковий доступ: Ліцензія не має обмежень по часу — ви отримуєте операційну систему у довічне користування без додаткових підписок.\n" +
            "\n" +
            "Миттєва доставка: Електронний спосіб розповсюдження дозволяє завантажити дистрибутив та активувати систему одразу після покупки.\n" +
            "\n" +
            "Багатомовність: Повна підтримка української, англійської та інших мов інтерфейсу.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Редакція: Домашня (Home).\n" +
            "\n" +
            "Розрядність: 64-біт (x64).\n" +
            "\n" +
            "Тип активації: Електронний ключ (ESD).\n" +
            "\n" +
            "Призначення: ПК, ноутбуки, моноблоки для приватного використання.","/images/w11.jpg"));
    products.add(new Product(57L,"Операційна система Windows 11 Професійна на 1ПК (ESD - електронна ліцензія в конверті, всі мови)","Other",273,"Microsoft Windows 11 Pro (ESD)\n" +
            "Професійна операційна система, розроблена для бізнесу, державних установ та досвідчених користувачів. Вона пропонує розширений функціонал для безпеки, керування та віддаленої роботи, забезпечуючи максимальну ефективність на сучасному ПК.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Офіційна ліцензія: Оригінальний продукт Microsoft (не вторинна ліцензія), що гарантує юридичну чистоту та повну технічну підтримку.\n" +
            "\n" +
            "Бізнес-функціонал: Включає розширені інструменти захисту даних, можливість приєднання до домену, підтримку Azure Active Directory та віддаленого робочого стола (Remote Desktop).\n" +
            "\n" +
            "Безстрокове використання: Ліцензія є довічною та не потребує щомісячних чи щорічних оплат.\n" +
            "\n" +
            "Зручність ESD: Електронний ключ дозволяє миттєво активувати систему після завантаження офіційного дистрибутиву.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Редакція: Професійна (Pro).\n" +
            "\n" +
            "Розрядність: 64-біт.\n" +
            "\n" +
            "Мови: Повна підтримка української, англійської та інших мов.\n" +
            "\n" +
            "Сфера застосування: Комерційні організації, освітні заклади та домашні офіси.","/images/ww1.jpg"));
    products.add(new Product(58L,"Коробка для кабеля UGREEN LP110 Universal Cable Management Box S Size","Other",15,"\n" +
            "Кабельна коробка, кабельний органайзер\n" +
            "\n" +
            "Попрощайтеся з плутаниною кабелів, плодуйте елегантність і лад ! Кабельний органайзер від Ugreen — це непомітна коробка, яка дасть змогу вам внести великі зміни у ваше середовище. У ньому розміщуватимуться та мережеві фільтри, що дасть змогу легко використовувати, наприклад, , а крім того, він забезпечить лад і захист від загоряння .\n" +
            "\n" +
            "Більше жодного безладу\n" +
            "Під столом сплуталися кабелі? Зарядні пристрої для телефонів валяються на столі у вітальні? Забудь про це. Кабельний органайзер Ugreen також дасть змогу тримати їх упорядковано і, крім того, приховати від сторонніх очей. Помістіть подовжувач всередину, закрийте кришку та прокладіть кабелі через зручні отвори. Нековзні накладки гарантують, що коробка завжди залишатиметься на місці .\n" +
            "\n" +
            "Елегантний варіант... кабелів\n" +
            "Так, це можливо! Кабель Ugreen і коробка захисту від перенапруги не тільки суто практичні. Мінімалістська форма та приглушені кольори роблять його елегантним доповненням інтер'єру.\n" +
            "\n" +
            "Для неслухняних домочадців\n" +
            "Малюки люблять грати саме з тим, чим їм не треба бути. Запобіжіть контакту дітей із кабелями , повністю прибравши кабелі від сторонніх очей і рук. Заховані в елегантну коробку, вони чинитимуть опір розпитам найменших домочадців, та й самі відтепер будуть у набагато більшій безпеці. Це також чудове рішення для власників хатніх тварин — жодна вилка не буде надкусана або пошкоджена будь-яким іншим образом.\n" +
            "\n" +
            "Коробка безпеки\n" +
            "Кабельна коробка від Ugreen захищає вміст від пилу та вологи і в такий спосіб захищає все довкілля від випадкового загоряння . Що важливо, матеріал, з якого вона виготовлена, також стійкий до високих температур.\n" +
            "\n" +
            "Розміри: Д278мм x Ш128мм x В131мм\n" +
            "Матеріал: термостійкий АБС\n" +
            "Застосування: вітальня, робочий стіл, домашній офіс, кухня тощо.","/images/box1.jpg"));
    products.add(new Product(58L,"Кабель DisplayPort - DisplayPort 1.4 8K 1м в оплетці SmartGo","Other",6,"Кабель DisplayPort 1.4 (8K/60Hz, 4K/144Hz)\n" +
            "Високотехнологічний кабель для передачі відео та аудіо надвисокої чіткості. Завдяки підтримці версії DisplayPort 1.4, він забезпечує максимальну плавність зображення, що критично важливо для геймінгу на високих частотах оновлення та професійної роботи з графікою.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Вражаюча продуктивність: Підтримує роздільну здатність 8K (60Hz), 4K (144Hz) та Full HD (240Hz). Пропускна здатність складає 32,4 Гбіт/с.\n" +
            "\n" +
            "Якість зображення: Повна підтримка HDR (глибина кольору 48 біт) та 3D-контенту для насичених та реалістичних кольорів.\n" +
            "\n" +
            "Преміальна конструкція: Подвійна нейлонова оплітка, потрійне екранування та позолочені роз'єми забезпечують довговічність і захист від перешкод.\n" +
            "\n" +
            "Надійні матеріали: Використання мідного дроту 28AWG гарантує стабільну передачу сигналу без втрат.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Версія: DisplayPort 1.4 (зворотно сумісний з 1.2 та 1.1).\n" +
            "\n" +
            "Довжина: 1 метр.\n" +
            "\n" +
            "Тип конекторів: M/M (вилка-вилка).\n" +
            "\n" +
            "Призначення: Монітори, ігрові ПК, ноутбуки, проєктори та телевізори.","/images/kabel2.jpg"));
    products.add(new Product(59L,"Intel Core i7-14700K","CPU",423,"Процесор 14-го покоління (Raptor Lake Refresh) — це надпотужне рішення для геймінгу на ультра-налаштуваннях, професійного відеомонтажу та роботи зі штучним інтелектом. Завдяки збільшеній кількості ядер порівняно з попередником, він демонструє вражаючу швидкість у багатопотокових завданнях.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Гібридна архітектура: 20 ядер (8 продуктивних та 12 ефективних) і 28 потоків дозволяють одночасно грати, стрімити та виконувати фонові завдання без втрати FPS.\n" +
            "\n" +
            "Вражаюча частота: Максимальний розгін до 5.6 ГГц забезпечує лідерські позиції в іграх та швидку реакцію складних програм.\n" +
            "\n" +
            "Універсальність пам'яті: Підтримка як сучасної DDR5, так і доступної DDR4, що дає гнучкість при виборі материнської плати.\n" +
            "\n" +
            "Готовність до майбутнього: Підтримка шини PCIe 5.0 для наступного покоління відеокарт та надшвидких NVMe накопичувачів.\n" +
            "\n" +
            "Розблокований множник (індекс K): Можливість додаткового оверклокінгу для ентузіастів.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Сокет: LGA 1700.\n" +
            "\n" +
            "Кеш-пам'ять: 33 МБ Intel Smart Cache.\n" +
            "\n" +
            "Графіка: Інтегроване ядро Intel UHD Graphics 770.\n" +
            "\n" +
            "Енергоспоживання: Базове 125 Вт (до 253 Вт у режимі Turbo).\n" +
            "\n" +
            "Комплектація: Tray/Box (без кулера — рекомендовано використовувати потужну СВО або топову повітряну вежу).","/images/cpu6.jpg"));
    products.add(new Product(60L,"Intel Core i7-7700K 4.2GHz/8MB s1151 TRAY","CPU",98,"\n" +
            "Intel Core i7-7700K — це чотириядерний процесор з підтримкою восьми потоків на архітектурі Kaby Lake, випущений у 2017 році. Один із найпотужніших представників сьомого покоління Core, популярний серед геймерів і ентузіастів завдяки високим частотам і розблокованому множнику.\n" +
            "\n" +
            "Ключові особливості:\n" +
            "\n" +
            "4 ядра / 8 потоків — висока продуктивність у багатозадачних програмах та іграх;\n" +
            "Базова частота 4.2 ГГц, Turbo Boost до 4.5 ГГц — чудова швидкодія та висока частота кадрів в іграх;\n" +
            "Кеш L3 — 8 МБ — пришвидшений доступ до даних і зменшення затримок;\n" +
            "Розблокований множник — легкий розгін для ентузіастів;\n" +
            "Підтримка DDR4-2400 та DDR3L-1600 — гнучкість у виборі оперативної пам’яті;\n" +
            "TDP — 91 Вт — помірне тепловиділення при штатній роботі.\n" +
            "Ідеальне застосування:\n" +
            "Підходить для створення потужного ігрового чи робочого ПК. Чудово справляється з сучасними іграми, стрімінгом та важкими програмами, особливо у поєднанні з продуктивною відеокартою та якісним охолодженням.","/images/cpu7.jpg"));
    products.add(new Product(61L,"ID-Cooling SE-214-XT Basic","Cooling",15,"Надійна башта початкового рівня, розроблена для ефективного охолодження сучасних процесорів середнього сегмента. Завдяки прямому контакту теплових трубок та компактним розмірам, цей кулер є чудовою альтернативою стандартним «боксовим» рішенням.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Висока ефективність (TDP 180 Вт): Чотири мідні теплові трубки діаметром 6 мм безпосередньо контактують із кришкою процесора, що забезпечує швидке відведення тепла.\n" +
            "\n" +
            "Тиха робота та довговічність: 120-мм вентилятор на гідродинамічному підшипнику (FDB) працює стабільно та тихо, автоматично регулюючи оберти залежно від навантаження (PWM).\n" +
            "\n" +
            "Універсальна сумісність: Підтримує всі актуальні сокети, включаючи Intel LGA 1700 та AMD AM5.\n" +
            "\n" +
            "Стриманий дизайн: Виконаний у класичному чорному кольорі без підсвічування, що ідеально підійде для строгих робочих або ігрових систем.\n" +
            "\n" +
            "Компактність: Висота 150 мм дозволяє встановити кулер у більшість сучасних корпусів формату Miditower та Minitower.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Конструкція: Баштова (алюмінієвий радіатор + мідні трубки).\n" +
            "\n" +
            "Вентилятор: 120 мм, швидкість 700–1800 об/хв.\n" +
            "\n" +
            "Повітряний потік: 76.16 CFM.\n" +
            "\n" +
            "Рівень шуму: До 35,2 дБ.\n" +
            "\n" +
            "Габарити: 124 х 72 х 150 мм; вага 500 г.","/images/cool6.jpg"));
    products.add(new Product(62L,"ID-COOLING Frozn A400 ARGB","Cooling",30,"Компактна та потужна башта, яка доводить, що ефективне охолодження може бути малогабаритним. Завдяки висоті всього 123 мм, цей кулер ідеально підходить для збірок у невеликих корпусах, забезпечуючи при цьому відмінне відведення тепла та сучасний зовнішній вигляд.\n" +
            "\n" +
            "Ключові переваги:\n" +
            "Дивовижна потужність (TDP 180 Вт): Незважаючи на компактні розміри, 4 теплові трубки дозволяють охолоджувати навіть досить гарячі процесори сучасних лінійок.\n" +
            "\n" +
            "Стильне ARGB-підсвічування: Вентилятор оснащений адресованим підсвічуванням (5V 3-pin), яке можна синхронізувати з іншими компонентами системи.\n" +
            "\n" +
            "Тиха та надійна робота: Використання гідродинамічного підшипника (FDB) гарантує низький рівень шуму (до 25,8 дБ) та тривалий термін служби.\n" +
            "\n" +
            "Компактність без компромісів: Вентилятор розміром 92 мм дозволив зменшити загальні габарити кулера, що вирішує проблему сумісності з високою оперативною пам'яттю та вузькими корпусами.\n" +
            "\n" +
            "Сучасна сумісність: Підтримує всі новітні платформи, включаючи Intel LGA 1851/1700 та AMD AM5.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "Конструкція: Баштова (алюміній + 4 мідні трубки).\n" +
            "\n" +
            "Вентилятор: 92 мм, швидкість 600–2200 об/хв (PWM).\n" +
            "\n" +
            "Рівень шуму: Надзвичайно низький — до 25,8 дБ.\n" +
            "\n" +
            "Живлення: 4-pin (вентилятор) + 3-pin 5V (підсвічування).\n" +
            "\n" +
            "Габарити: 93 х 78 х 123 мм; вага 580 г.","/images/cool7.jpg"));
    products.add(new Product(63L,"Goodram DDR5-6400 32768MB PC5-51200 (Kit of 2x16384) IRDM Black","RAM",399,"Працюйте та грайте як професіонал\n" +
            "Максимізуйте роботу завдяки величезній швидкості низькопрофільних модулів IRDM DDR5. Ви отримаєте неперевершену плавність навіть під час одночасної роботи декількох застосунків, що підвищить ефективність вашої роботи. На вас чекають тривалі та вимогливі ігрові сесії? Тут немає місця компромісам.\n" +
            "\n" +
            "Розширте межі продуктивності\n" +
            "Новий стандарт пам'яті - це величезний технологічний стрибок. Він забезпечує колосальну різницю в продуктивності. Модулі DDR5 забезпечують збільшення пропускної спроможності на 50% порівняно з четвертим поколінням, а також більшу місткість, що досягається завдяки подвоєнню кількості банків. Це означає вражаючу продуктивність у новітніх іграх і програмах для роботи з даними, а також у таких вимогливих додатках, як рендеринг або анімація.\n" +
            "\n" +
            "Покращене керування живленням\n" +
            "Стабільність роботи за екстремальних тактових частот забезпечується завдяки технології PMIC - інтегрованій ІС керування живленням. Модулі DDR5 IRDM забезпечують величезну швидкість і ефективність при збереженні стабільності та ще більш низькому енергоспоживанні. Пам'ять DDR5 споживає на 30% менше енергії порівняно з попередніми поколіннями.\n" +
            "\n" +
            "Простий розгін\n" +
            "Модулі пам'яті IRDM DDR5 оснащені SPD HUB - мікросхемою з вбудованим температурним датчиком. Це дає змогу передавати відповідну інформацію по шині I3C для налаштування таких параметрів, як швидкість і затримка. Для OC-модулів він забезпечує завантаження профілю XMP. Підтримка профілю Intel XMP 3.0 полегшує розгін без необхідності складного налаштування в BIOS.\n" +
            "\n" +
            "Технологія підвищення надійності\n" +
            "Вбудована технологія ECC (код корекції помилок) усуває практично всі бітові помилки в модулі DRAM. Це дає змогу досягти практично повної надійності. Усе для того, щоб ви могли без страху досягати більшого - разом із вашим обладнанням.\n" +
            "\n" +
            "Будьте готові до майбутнього вже зараз! Приєднуйтесь до числа користувачів IRDM і відкрийте для себе неперевершений потенціал. Прийміть виклик і змініть те, як ви працюєте, творите і граєте!","/images/ope5.jpg"));
    products.add(new Product(64L,"Kingston Fury DDR5-6000 65536MB PC5-48000 (Kit of 2x32768) Beast AM5 White","RAM",771,"\n" +
            "Оперативна памʼять Kingston FURY Beast AM5 DDR5 призначена для підвищення продуктивності сучасних ПК в іграх, а також задачах стримінгу, редагування відео високої роздільної здатності, рендерингу та інших ресурсомістких програм. Крім стандартного профілю JEDEC, модуль забезпечений двома профілями AMD EXPO та двома XMP 3.0 профілями.\n" +
            "\n" +
            "Збільшуючи швидкість, місткість та надійність, Kingston FURY Beast AM5 DDR5 пропонує цілий арсенал розширених функцій, таких як ECC на кристалі (ODECC) для підвищення стабільності на екстремальних швидкостях, два 32-бітових підканали для підвищення ефективності та інтегрована в модуль схема управління живленням (PMIC), що забезпечує контроль та підстроювання напруг безпосередньо на модулі памʼяті. При грі в найекстремальніших умовах, при стрімінгу у форматі 4K і вище або при серйозній анімації та 3D-рендерингу, Kingston FURY Beast AM5 DDR5 – це наступне підвищення рівня, при якому ідеально поєднуються стиль та продуктивність. Памʼять Kingston FURY Beast AM5 DDR5 була протестована та схвалена MSI, ASUS, ASRock та Gigabyte – провідними світовими виробниками материнських плат.\n" +
            "\n" +
            "Памʼять Kingston FURY Beast AM5 DDR5 отримала сертифікат AMD EXPO, це означає, що користувачі можуть розраховувати на простий, стабільний та сертифікований розгін на платформах AMD AM5. Крім того, памʼять має профілі Intel XMP 3.0, що дозволяють легко розганяти її і на платформі Intel.\n" +
            "\n" +
            "Особливості:\n" +
            "\n" +
            "Підвищена стабільність при розгоні: Корекція помилок на кристалі (On-die ECC, ODECC) допомагає забезпечити цілісність даних при розгоні памʼяті підвищення її продуктивності.\n" +
            "Збільшена ефективність: Подвоєння як кількості банків, так і довжини пакета, а також поділ шини на два незалежні 32-бітові субканали дозволяє DDR5 значно ефективніше працювати з сучасними іграми, програмами та ресурсомісткими додатками.\n" +
            "Схвалена провідними світовими виробниками материнських плат: Протестована і затверджена — користувач може з упевненістю використовувати цю памʼять з материнською платою, якій вони віддають перевагу.\n" +
            "Низькопрофільний теплорозподільник: Теплорозподільник оригінального дизайну забезпечує стильний зовнішній вигляд і високу ефективність охолодження.\n" +
            "Сертифікація AMD EXPO: Заздалегідь оптимізовані таймінги, частоти та напруги для забезпечення високої продуктивності та стабільності при оверклокінгу.","/images/ope6.jpg"));
    products.add(new Product(65L,"Мікрофон Vertux Streamer-3 LED, USB Black","Periphery",7,"\n" +
            "Стильний, агресивний дизайн і якісне звукозаписування — Vertux Streamer-3 ідеально підійде для ігрового стримера, геймера або професійного ютубера.\n" +
            "\n" +
            "Особливості:\n" +
            "\n" +
            "Антивібраційна стійка: Ізолює від зовнішніх вібрацій комп'ютера, клавіатури та мишки. У парі з вбудованим аудіофільтром, забезпечує чітке та чисте записування без шумів і перешкод.\n" +
            "Функціональна конструкція: Регулятор нахилу в поєднанні з гнучкою шиєю з міцного алюмінію дають змогу виставити комфортне положення мікрофона.\n" +
            "Геймерський дизайн: Агресивні форми й елементи з металу підкреслюють характер ґаджета.\n" +
            "LED-підсвітка: Відтворить ігрову атмосферу та налаштує тебе на перемогу. Керуй підсвіткою за допомогою вбудованого перемикача.\n" +
            "Роз'єм 3.5 мм (AUX): Під'єднуй свої навушники безпосередньо через Streamer-3.\n" +
            "Кнопка Mute: Вимикай звук на мікрофоні одним натисканням.\n" +
            "Plug&Play: Windows або Mac OS і жодного додаткового ПЗ, тобі потрібен тільки вільний USB-порт.\n" +
            "Універсальна сумісність: Працює з більшістю комп'ютерних програм для обробки та запису звуку.\n" +
            "\n" +
            "Технічні характеристики:\n" +
            "\n" +
            "Роз'єм: USB\n" +
            "Чутливість: -23 дБ ± 4 дБ\n" +
            "Діапазон: 100 Гц — 10 кГц\n" +
            "Опір: 2,2 кОм\n" +
            "Довжина кабелю: 150 см\n" +
            "Розмір ШхВхГ: 95х210х125\n" +
            "Вага: 148 г","/images/mikro1.jpg"));
    products.add(new Product(66L,"Клавіатура дротова A4Tech Bloody S98 Naraka BLMS USB","Periphery",60,"Ця модель — компонент ігрового набору, виконаного у стилі гри Naraka: Bladepoint. Лінійний і плавний хід механічних перемикачів BLMS забезпечує комфортну та точну роботу клавіатури.\n" +
            "\n" +
            "Особливості:\n" +
            "\n" +
            "Механічні перемикачі Bloody BLMS. Спеціально налаштована точка та сила спрацювання забезпечують виняткову швидкість і чутливість під час гри!\n" +
            "Можливість гарячої заміни. Сумісна з 3-контактними та 5-контактними механічними перемикачами\n" +
            "Надзвичайно тихий набір тексту. Силіконові вставки зменшують шум під час друку 25 ігрових PBT-кейкапів\n" +
            "Кейкапи виготовлені з PBT-пластику для підвищеної довговічності. PBT-кейкапи Bloody мають ідеально вивірену вагу для своєчасного відгуку при натисканні\n" +
            "98-клавішна клавіатура. Компактний двозонний дизайн забезпечує функціональність, еквівалентну повнорозмірній клавіатурі, займаючи мінімум місця\n" +
            "Укладання кабелю в 3 напрямках. Клавіатура має інтерфейс Type-C із трьома варіантами виведення кабелю для зручного менеджменту\n" +
            "Дві регульовані ніжки. Ніжки мають два рівні налаштування для оптимального кута нахилу під різні завдання\n" +
            "RGB-підсвічування. Вільно налаштовуйте 16,8 мільйонів кольорових варіантів і створюйте унікальний дизайн\n" +
            "10 ефектів підсвічування за замовчуванням. Перемикайте ефекти за допомогою комбінації «FN + 0~9» без програмного забезпечення\n" +
            "7 ігрових режимів. Натисніть Fn + F9/F10 для перемикання між 7 макросами\n" +
            "4 МБ вбудованої памʼяті. Клавіатура може зберігати до 7 профілів налаштувань для використання на різних комп’ютерах без необхідності встановлення ПЗ","/images/klava2.jpg"));
    }

    @GetMapping("/products")
    public String getProducts(Model model) {

        List<Product> cpuList = new ArrayList<>();
        List<Product> gpuList = new ArrayList<>();
        List<Product> ramList = new ArrayList<>();
        List<Product> otherList = new ArrayList<>();
        List<Product> motherList = new ArrayList<>();
        List<Product> peripheryList = new ArrayList<>();
        List<Product> psuList = new ArrayList<>();
        List<Product> coolingList = new ArrayList<>();

        for (Product p : products) {
            if (p.getCategory().equals("CPU")) cpuList.add(p);
            else if (p.getCategory().equals("GPU")) gpuList.add(p);
            else if (p.getCategory().equals("RAM")) ramList.add(p);
            else if (p.getCategory().equals("Other")) otherList.add(p);
            else if (p.getCategory().equals("Mother")) motherList.add(p);
            else if (p.getCategory().equals("Periphery")) peripheryList.add(p);
            else if (p.getCategory().equals("PSU")) psuList.add(p);
            else if (p.getCategory().equals("Cooling")) coolingList.add(p);
        }

        model.addAttribute("cpuList", cpuList);
        model.addAttribute("gpuList", gpuList);
        model.addAttribute("ramList", ramList);
        model.addAttribute("otherList", otherList);
        model.addAttribute("motherList", motherList);
        model.addAttribute("peripheryList", peripheryList);
        model.addAttribute("psuList", psuList);
        model.addAttribute("coolingList", coolingList);

        return "products";
    }

    @GetMapping("/periphery")
    public String getPeriphery(Model model) {
        List<Product> products = getAllProducts();

        List<Product> peripheryList = new ArrayList<>();

        for (Product p : products) {
            if ("Periphery".equals(p.getCategory())) {
                peripheryList.add(p);
            }
        }

        model.addAttribute("peripheryList", peripheryList);
        return "periphery";
    }


    // 🔥 СТОРІНКА ОДНОГО ТОВАРУ
    @GetMapping("/product/{id}")
    public String getProductById(@PathVariable Long id, Model model) {

        Product foundProduct = null;

        for (Product product : products) {
            if (product.getId().equals(id)) {
                foundProduct = product;
                break;
            }
        }

        model.addAttribute("product", foundProduct);
        return "product";
    }
}